"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 10000, \"filters\": \"\", \"lower\": false, \"split\": \" \", \"char_level\": false, \"oov_token\": \"<UNK>\", \"document_count\": 130369, \"word_counts\": \"{\\\"s\\\": 868, \\\"=\\\": 5635, \\\"list\\\": 417, \\\"(\\\": 12046, \\\"raw_input\\\": 127, \\\")\\\": 12046, \\\"\\\\n\\\": 15548, \\\"t\\\": 116, \\\"[\\\": 2397, \\\"]\\\": 2397, \\\"for\\\": 1216, \\\"e\\\": 10, \\\"in\\\": 1246, \\\":\\\": 4523, \\\"if\\\": 1503, \\\"is\\\": 5, \\\"\\\\\\\"B\\\\\\\"\\\": 76, \\\".\\\": 2866, \\\"pop\\\": 96, \\\"else\\\": 763, \\\"append\\\": 355, \\\"print\\\": 2092, \\\"\\\\\\\"\\\\\\\"\\\": 215, \\\"join\\\": 208, \\\"input\\\": 1846, \\\"a\\\": 1707, \\\"n\\\": 1172, \\\"i\\\": 2133, \\\"range\\\": 705, \\\"len\\\": 420, \\\">\\\": 214, \\\"0\\\": 1389, \\\"and\\\": 351, \\\"==\\\": 1651, \\\"-\\\": 875, \\\"1\\\": 1420, \\\"elif\\\": 343, \\\"'0'\\\": 115, \\\"'1'\\\": 265, \\\"answer\\\": 31, \\\"+=\\\": 316, \\\"ans\\\": 808, \\\"''\\\": 208, \\\"new_a\\\": 4, \\\"str\\\": 358, \\\"+\\\": 587, \\\"sentence\\\": 7, \\\"continue\\\": 32, \\\"w\\\": 453, \\\"!=\\\": 240, \\\"k\\\": 93, \\\"int\\\": 1619, \\\"\\\\\\\"enter\\\": 1, \\\"keys=\\\\\\\"\\\": 1, \\\"b\\\": 965, \\\"\\\\\\\"\\\": 378, \\\"length\\\": 21, \\\"while\\\": 263, \\\"<=\\\": 61, \\\"or\\\": 146, \\\"import\\\": 538, \\\"re\\\": 15, \\\"text\\\": 26, \\\"b_length\\\": 4, \\\"sub\\\": 4, \\\"'B'\\\": 100, \\\",\\\": 3666, \\\"_\\\": 75, \\\"'(0|1)??B'\\\": 2, \\\"x\\\": 2086, \\\"li\\\": 49, \\\"sz\\\": 4, \\\"-=\\\": 24, \\\"end\\\": 104, \\\"del\\\": 28, \\\"collections\\\": 43, \\\"S\\\": 232, \\\"N\\\": 429, \\\"D\\\": 25, \\\"deque\\\": 30, \\\"\\\\\\\"0\\\\\\\"\\\": 81, \\\"\\\\\\\"1\\\\\\\"\\\": 215, \\\"word\\\": 26, \\\"\\\\\\\"a\\\\\\\"\\\": 3, \\\"\\\\t\\\": 120, \\\"\\\\t\\\\t\\\": 88, \\\"\\\\t\\\\t\\\\t\\\": 14, \\\"c\\\": 261, \\\"*\\\": 1581, \\\"sep\\\": 19, \\\"from\\\": 145, \\\"p\\\": 69, \\\"popleft\\\": 5, \\\"string\\\": 33, \\\"ss\\\": 19, \\\"remove\\\": 13, \\\"#!/bin/usr/env\\\": 1, \\\"j\\\": 118, \\\"enumerate\\\": 16, \\\"pass\\\": 23, \\\"ln\\\": 6, \\\"s1\\\": 31, \\\"'[^B]'\\\": 1, \\\"key\\\": 29, \\\"rstrip\\\": 39, \\\"\\\\\\\"A\\\\\\\"\\\": 5, \\\"num\\\": 124, \\\"b_cnt\\\": 6, \\\"<\\\": 172, \\\"reverse\\\": 136, \\\"sys\\\": 317, \\\"defaultdict\\\": 10, \\\"Counter\\\": 20, \\\"math\\\": 487, \\\"ceil\\\": 9, \\\"sqrt\\\": 8, \\\"hypot\\\": 3, \\\"factorial\\\": 6, \\\"pi\\\": 361, \\\"sin\\\": 3, \\\"cos\\\": 3, \\\"tan\\\": 1, \\\"asin\\\": 1, \\\"acos\\\": 1, \\\"atan\\\": 1, \\\"radians\\\": 3, \\\"degrees\\\": 1, \\\"log2\\\": 2, \\\"itertools\\\": 19, \\\"accumulate\\\": 6, \\\"permutations\\\": 7, \\\"combinations\\\": 7, \\\"combinations_with_replacement\\\": 1, \\\"product\\\": 6, \\\"groupby\\\": 2, \\\"operator\\\": 7, \\\"itemgetter\\\": 7, \\\"mul\\\": 6, \\\"copy\\\": 56, \\\"deepcopy\\\": 13, \\\"ascii_lowercase\\\": 4, \\\"ascii_uppercase\\\": 3, \\\"digits\\\": 7, \\\"bisect\\\": 13, \\\"bisect_left\\\": 6, \\\"fractions\\\": 14, \\\"gcd\\\": 240, \\\"heapq\\\": 14, \\\"heappush\\\": 5, \\\"heappop\\\": 7, \\\"functools\\\": 11, \\\"reduce\\\": 7, \\\"def\\\": 361, \\\"return\\\": 349, \\\"stdin\\\": 171, \\\"readline\\\": 97, \\\"strip\\\": 27, \\\"INT\\\": 7, \\\"MAP\\\": 6, \\\"map\\\": 655, \\\"split\\\": 856, \\\"LIST\\\": 5, \\\"ZIP\\\": 1, \\\"zip\\\": 1, \\\"setrecursionlimit\\\": 14, \\\"10\\\": 108, \\\"**\\\": 115, \\\"9\\\": 64, \\\"INF\\\": 8, \\\"float\\\": 221, \\\"'inf'\\\": 6, \\\"mod\\\": 34, \\\"7\\\": 27, \\\"r\\\": 804, \\\"result\\\": 70, \\\"str_result\\\": 2, \\\"replace\\\": 140, \\\"__name__\\\": 82, \\\"\\\\\\\"__main__\\\\\\\"\\\": 36, \\\"input_str\\\": 2, \\\"#\\\": 290, \\\"f_inf\\\": 1, \\\"resolve\\\": 4, \\\"res\\\": 52, \\\"'__main__'\\\": 46, \\\"s_list\\\": 2, \\\"L\\\": 65, \\\"d\\\": 102, \\\"F\\\": 13, \\\"ch\\\": 7, \\\"T\\\": 36, \\\"queue\\\": 5, \\\"8\\\": 7, \\\"inp\\\": 13, \\\"inpl\\\": 4, \\\"inpl_str\\\": 1, \\\"inpln\\\": 1, \\\"q\\\": 20, \\\"\\\\\\\"\\\\\\\\n\\\\\\\"\\\": 18, \\\"i2\\\": 1, \\\"l\\\": 294, \\\"intl\\\": 2, \\\"lx\\\": 3, \\\"lambda\\\": 59, \\\"tuple\\\": 6, \\\"moji\\\": 12, \\\"keys\\\": 3, \\\"out\\\": 21, \\\"input_list\\\": 16, \\\"out_list\\\": 6, \\\"not\\\": 23, \\\"#print(ans)\\\": 1, \\\"ret\\\": 31, \\\"cnt\\\": 21, \\\"try\\\": 83, \\\"except\\\": 83, \\\"IndexError\\\": 2, \\\"chr\\\": 3, \\\"0x08\\\": 1, \\\"False\\\": 32, \\\"True\\\": 155, \\\"coding:\\\": 52, \\\"utf-8\\\": 61, \\\"random\\\": 2, \\\"time\\\": 9, \\\"os\\\": 6, \\\"datetime\\\": 1, \\\"lru_cache\\\": 5, \\\"#@lru_cache(maxsize=None)\\\": 1, \\\"2000000\\\": 1, \\\"#import\\\": 3, \\\"numpy\\\": 12, \\\"as\\\": 21, \\\"np\\\": 36, \\\"alphabet\\\": 1, \\\"\\\\\\\"abcdefghijklmnopqrstuvwxyz\\\\\\\"\\\": 1, \\\"inf\\\": 3, \\\"20\\\": 2, \\\"yn\\\": 2, \\\"\\\\\\\"yes\\\\\\\"\\\": 2, \\\"\\\\\\\"no\\\\\\\"\\\": 2, \\\"Yn\\\": 1, \\\"\\\\\\\"Yes\\\\\\\"\\\": 2, \\\"\\\\\\\"No\\\\\\\"\\\": 2, \\\"YN\\\": 1, \\\"\\\\\\\"YES\\\\\\\"\\\": 2, \\\"\\\\\\\"NO\\\\\\\"\\\": 2, \\\"class\\\": 8, \\\"union_find\\\": 1, \\\"__init__\\\": 5, \\\"self\\\": 135, \\\"P\\\": 12, \\\"rank\\\": 6, \\\"find\\\": 16, \\\"same\\\": 2, \\\"y\\\": 1731, \\\"link\\\": 2, \\\"unite\\\": 1, \\\"size\\\": 10, \\\"set\\\": 25, \\\"add\\\": 8, \\\"is_power\\\": 1, \\\"#a\\\\u306fb\\\\u306e\\\\u7d2f\\\\u4e57\\\\u6570\\\\u304b\\\": 1, \\\"now\\\": 4, \\\"*=\\\": 9, \\\"bin_\\\": 1, \\\"A\\\": 430, \\\">>\\\": 5, \\\"&\\\": 17, \\\"get_facs\\\": 1, \\\"mod_\\\": 2, \\\"2\\\": 972, \\\"%=\\\": 2, \\\"comb\\\": 2, \\\"fac\\\": 4, \\\"pow\\\": 8, \\\"%\\\": 437, \\\"next_comb\\\": 1, \\\"z\\\": 61, \\\"~\\\": 1, \\\"//=\\\": 8, \\\"|\\\": 2, \\\">=\\\": 74, \\\"<<\\\": 8, \\\"get_primes\\\": 1, \\\"type\\\": 13, \\\"\\\\\\\"int\\\\\\\"\\\": 1, \\\"\\\\\\\"bool\\\\\\\"\\\": 1, \\\"B\\\": 80, \\\"is_prime\\\": 1, \\\"ifelse\\\": 1, \\\"factorize\\\": 1, \\\"type_\\\": 3, \\\"\\\\\\\"dict\\\\\\\"\\\": 2, \\\"list_\\\": 5, \\\"dic\\\": 5, \\\"{\\\": 31, \\\"}\\\": 31, \\\"\\\\\\\"list\\\\\\\"\\\": 1, \\\"None\\\": 12, \\\"floor_\\\": 1, \\\"//\\\": 96, \\\"ceil_\\\": 1, \\\"hani\\\": 1, \\\"min_\\\": 3, \\\"max_\\\": 3, \\\"seifu\\\": 1, \\\"abs\\\": 20, \\\"###################################################\\\": 1, \\\"main\\\": 129, \\\"'0B'\\\": 3, \\\"'1B'\\\": 3, \\\"\\\\\\\"{}\\\\\\\"\\\": 7, \\\"format\\\": 161, \\\"si\\\": 3, \\\"inputs\\\": 16, \\\"stack\\\": 12, \\\"str_len\\\": 2, \\\"out_string\\\": 6, \\\"S_list\\\": 2, \\\"S_num\\\": 3, \\\"answer_honmono\\\": 2, \\\"2000\\\": 1, \\\"100\\\": 22, \\\"105\\\": 3, \\\"floor\\\": 10, \\\"S_MAP\\\": 2, \\\"S_LIST\\\": 2, \\\"-*-\\\": 77, \\\"coding\\\": 2, \\\"\\\\\\\"3\\\\\\\"\\\": 13, \\\"m\\\": 161, \\\"count\\\": 56, \\\"index\\\": 36, \\\"max\\\": 317, \\\"display\\\": 15, \\\"first_str\\\": 2, \\\"total_list\\\": 6, \\\"total\\\": 2, \\\"orders\\\": 2, \\\"order\\\": 4, \\\"#####\\\": 2, \\\"\\\\u89e3\\\\u3051\\\\u305f\\\": 1, \\\"\\\\u5165\\\\u529b\\\\u306e\\\\u6587\\\\u5b57\\\\u52171\\\\u6587\\\\u5b57\\\\u305a\\\\u3064\\\\u898b\\\\u3066\\\\u3086\\\\u304f\\\": 1, \\\"\\\\u3082\\\\u30570\\\\u304b1\\\\u306e\\\\u5834\\\\u5408\\\\u3001\\\\u305d\\\\u308c\\\\u3092\\\\u8ffd\\\\u52a0\\\": 1, \\\"\\\\u3082\\\\u3057\\\\u30d0\\\\u30c3\\\\u30af\\\\u30b9\\\\u30da\\\\u30fc\\\\u30b9\\\\u306e\\\\u5834\\\\u5408\\\\u30011\\\\u6587\\\\u5b57\\\\u524a\\\\u9664\\\": 1, \\\"\\\\u30d0\\\\u30a4\\\\u30ca\\\\u30ea\\\\u30cf\\\\u30c3\\\\u30af\\\\u30a4\\\\u30fc\\\\u30b8\\\\u30fc\\\": 1, \\\"lst\\\": 56, \\\"R\\\": 25, \\\"'b'\\\": 4, \\\"'1b'\\\": 1, \\\"'0b'\\\": 1, \\\"ni\\\": 3, \\\"ns\\\": 17, \\\"na\\\": 10, \\\"solve\\\": 16, \\\"_s\\\": 2, \\\"cin\\\": 6, \\\"cino\\\": 2, \\\"test\\\": 4, \\\"cina\\\": 1, \\\"convert\\\": 2, \\\"initialization\\\": 1, \\\"of\\\": 1, \\\"to\\\": 1, \\\"new\\\": 13, \\\"traverse\\\": 1, \\\"the\\\": 1, \\\"nl\\\": 11, \\\"sl\\\": 1, \\\"print(s)\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"\\\\nCreated\\\": 2, \\\"on\\\": 2, \\\"Thu\\\": 1, \\\"Jun\\\": 1, \\\"11\\\": 4, \\\"17:09:47\\\": 1, \\\"2020\\\\n\\\\n@author:\\\": 2, \\\"sd18016\\\\n\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u5217\\\\u306e\\\\u5165\\\\u529b\\\": 2, \\\"#\\\\u7b54\\\\u3048\\\\u7528\\\\u610f\\\": 1, \\\"#\\\\u672b\\\\u5c3e\\\\u306b\\\\u8981\\\\u7d20\\\\u8ffd\\\\u52a0\\\": 1, \\\"#\\\\u9577\\\\u3055\\\": 1, \\\"#\\\\u6307\\\\u5b9a\\\\u3057\\\\u305f\\\\u4f4d\\\\u7f6e(\\\\u4eca\\\\u56de\\\\u306f\\\\u672b\\\\u5c3e:-1)\\\\u306e\\\\u8981\\\\u7d20\\\\u3092\\\\u524a\\\\u9664\\\": 1, \\\"/usr/bin/python3\\\": 1, \\\"Queue\\\": 1, \\\"LifoQueue\\\": 1, \\\"Stack\\\": 2, \\\"cmp_to_key\\\": 1, \\\"__MOD__\\\": 13, \\\"'YNeos'\\\": 1, \\\"judge\\\": 1, \\\"lcm\\\": 4, \\\"intinput\\\": 2, \\\"mulinputs\\\": 1, \\\"lineinputs\\\": 1, \\\"func\\\": 4, \\\"datas\\\": 3, \\\"EOFError\\\": 41, \\\"break\\\": 122, \\\"ModInt\\\": 6, \\\"__x\\\": 21, \\\"__add__\\\": 1, \\\"other\\\": 35, \\\"__class__\\\": 15, \\\"raise\\\": 8, \\\"Exception\\\": 10, \\\"\\\\\\\"Not\\\": 5, \\\"Int\\\": 5, \\\"Not\\\": 5, \\\"ModInt\\\\\\\"\\\": 5, \\\"__sub__\\\": 1, \\\"__mul__\\\": 1, \\\"__truediv__\\\": 1, \\\"__modinv\\\": 3, \\\"__pow__\\\": 1, \\\"ZeroDivisionError\\\": 1, \\\"\\\\\\\"%s\\\\u306e\\\\u9006\\\\u6570\\\\u306f\\\\u6c42\\\\u307e\\\\u308a\\\\u307e\\\\u305b\\\\u3093\\\\u3002\\\\\\\"\\\": 1, \\\"u\\\": 15, \\\"v\\\": 52, \\\";\\\": 53, \\\"__int__\\\": 1, \\\"stk\\\": 6, \\\"ret,\\\": 1, \\\"'',\\\": 1, \\\"len(S):\\\": 1, \\\"S[i]\\\": 2, \\\"'B':\\\": 1, \\\"1:\\\": 1, \\\"else:\\\": 3, \\\"ret[:i-1]\\\": 1, \\\"ret[i+1:]\\\": 1, \\\"empty\\\": 2, \\\"get\\\": 7, \\\"put\\\": 1, \\\"\\\\u51fa\\\\u529b\\\": 1, \\\"EOF\\\": 1, \\\"rr\\\": 2, \\\"rs\\\": 2, \\\"ri\\\": 5, \\\"rm\\\": 1, \\\"rl\\\": 4, \\\"data\\\": 53, \\\"row\\\": 5, \\\"buffer\\\": 6, \\\"st\\\": 8, \\\"'1\\\\t'\\\": 1, \\\"#!/usr/bin/env\\\": 17, \\\"python3\\\": 12, \\\"reslut\\\": 5, \\\"#B\\\\u304c\\\\u5b58\\\\u5728\\\\u3059\\\\u308b\\\\u9593\\\\u5b9f\\\\u884c\\\": 1, \\\"#\\\\u6700\\\\u521d\\\\u306eB\\\\u306e\\\\u30a4\\\\u30f3\\\\u30c7\\\\u30c3\\\\u30af\\\\u30b9\\\\u3092\\\\u53d6\\\\u5f97\\\": 1, \\\"B\\\\u304c\\\\u5148\\\\u982d\\\\u3067\\\\u306a\\\\u3044\\\\u3068\\\\u304d\\\": 1, \\\"B\\\\u306e1\\\\u500b\\\\u524d\\\\u3068B\\\\u3092\\\\u6d88\\\\u3059\\\": 1, \\\"B\\\\u304c\\\\u5148\\\\u982d\\\\u306e\\\\u6642\\\": 1, \\\"#\\\\u3053\\\\u306e\\\\u533a\\\\u5207\\\\u308a\\\\u6587\\\\u5b57\\\\u3067\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u9023\\\\u7d50\\\": 1, \\\"exit\\\": 21, \\\"arr\\\": 22, \\\"flg\\\": 13, \\\"STR\\\": 4, \\\"cha\\\": 2, \\\"plist\\\": 7, \\\"typing\\\": 2, \\\"ANS\\\": 2, \\\"#\\\\u5165\\\\u529b\\\": 2, \\\"#\\\\u7a7a\\\\u306e\\\\u30ea\\\\u30b9\\\\u30c8\\\": 1, \\\"#c\\\\u304c0\\\\u6587\\\\u5b57\\\\u76ee\\\\u304b\\\\u3089a\\\\u307e\\\\u3067\\\": 1, \\\"#B\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070\\\\u30a2\\\\u30da\\\\u30f3\\\\u30c9\\\": 1, \\\"#B\\\\u3067\\\\u3042\\\\u3063\\\\u3066\\\\u3055\\\\u3089\\\\u306b\\\\u30ea\\\\u30b9\\\\u30c8\\\\u304c\\\\u304b\\\\u3089\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070pop\\\": 1, \\\"#list\\\\u3092\\\\u304f\\\\u3063\\\\u3064\\\\u3051\\\\u305f\\\\u6587\\\\u5b57\\\\u306b\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"coding:utf-8\\\": 7, \\\"18\\\": 4, \\\"MOD\\\": 5, \\\"YesNo\\\": 1, \\\"bool\\\": 6, \\\"'Yes'\\\": 2, \\\"'No'\\\": 2, \\\"YESNO\\\": 1, \\\"'YES'\\\": 2, \\\"'NO'\\\": 2, \\\"int1\\\": 1, \\\"IN\\\": 8, \\\"OUT\\\": 5, \\\"#input\\\": 1, \\\"numbers\\\": 12, \\\"max_value\\\": 8, \\\"count_max\\\": 2, \\\"index_max\\\": 3, \\\"numbers_second\\\": 3, \\\"second_max_value\\\": 5, \\\"one\\\": 2, \\\"two\\\": 4, \\\"a_i\\\": 2, \\\"Nmax1\\\": 8, \\\"Nmax2\\\": 7, \\\"array\\\": 15, \\\"all_max\\\": 7, \\\"max_ind\\\": 7, \\\"argmax\\\": 4, \\\"max_remove\\\": 3, \\\"ones\\\": 1, \\\"dtype\\\": 1, \\\"second_max\\\": 2, \\\"print(all_max)\\\": 1, \\\"print(second_max)\\\": 1, \\\"ma\\\": 17, \\\"ma2\\\": 2, \\\"sorted\\\": 83, \\\"fst\\\": 8, \\\"snd\\\": 7, \\\"al\\\": 10, \\\"max_a\\\": 22, \\\"filter\\\": 2, \\\"MAX\\\": 6, \\\"s2\\\": 35, \\\"sorted_A\\\": 5, \\\"max_idx\\\": 9, \\\"As\\\": 6, \\\"instAs\\\": 3, \\\"seq\\\": 15, \\\"tmp\\\": 90, \\\"heapify\\\": 2, \\\"indexed_A\\\": 4, \\\"reversed\\\": 34, \\\"nums\\\": 56, \\\"v_sort\\\": 3, \\\"v_max\\\": 3, \\\"v_max2\\\": 2, \\\"sort\\\": 36, \\\"max_pos\\\": 4, \\\"#\\\\u6700\\\\u5927\\\\u5024\\\\u306eindex\\\\u3092\\\\u63a2\\\\u3057\\\\u3001\\\\u6700\\\\u5927\\\\u5024\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\\u78ba\\\\u8a8d\\\": 1, \\\"first_max_id\\\": 2, \\\"c_dash\\\": 2, \\\"pr_val\\\": 4, \\\"aa\\\": 23, \\\"a_max\\\": 12, \\\"a_max_ind\\\": 2, \\\"a1\\\": 11, \\\"a2\\\": 5, \\\"maxA\\\": 5, \\\"secA\\\": 2, \\\"#print(N,A,maxA,secA,num)\\\": 1, \\\"[]\\\": 2, \\\"range(N):\\\": 1, \\\"A.append(int(input()))\\\": 1, \\\"_ans\\\": 3, \\\"buff\\\": 10, \\\"_m\\\": 5, \\\"range(i,\\\": 1, \\\"N,\\\": 1, \\\"max(1,\\\": 1, \\\"i)):\\\": 1, \\\"buff[j]\\\": 1, \\\"sum(buff[i:N])\\\": 1, \\\"mm\\\": 2, \\\"sum\\\": 71, \\\"second\\\": 17, \\\"max_k\\\": 6, \\\"min_k\\\": 2, \\\"min\\\": 165, \\\"kk\\\": 4, \\\"setA\\\": 2, \\\"tempA\\\": 2, \\\"max_v\\\": 6, \\\"max_v2\\\": 3, \\\"signal\\\": 1, \\\"apple\\\": 9, \\\"big\\\": 12, \\\"orange\\\": 3, \\\"A_i\\\": 3, \\\"m_i\\\": 2, \\\"slove\\\": 4, \\\"'\\\\\\\\n'\\\": 9, \\\"NL\\\": 4, \\\"#C\\\": 2, \\\"fi\\\": 3, \\\"se\\\": 2, \\\"M\\\": 29, \\\"m0\\\": 1, \\\"#print(d,\\\": 1, \\\"len(M))\\\": 1, \\\"#print(\\\\\\\"M[:d]\\\\\\\",\\\": 1, \\\"M[:d])\\\": 1, \\\"#print(\\\\\\\"M[d+1:]\\\\\\\",\\\": 1, \\\"M[d+1:])\\\": 1, \\\"#print(\\\\\\\"d=%d,\\\\\\\"%d,\\\": 1, \\\"m,\\\": 1, \\\"max(A[:i]+A[i+1:]))\\\": 1, \\\"#assert\\\": 1, \\\"max(A[:i]+A[i+1:])\\\": 1, \\\"#l\\\": 2, \\\"list(range(1,\\\": 1, \\\"200))\\\": 1, \\\"#solve(len(l),\\\": 1, \\\"l)\\\": 1, \\\"A_max\\\": 20, \\\"A_copy\\\": 9, \\\"A_max_second\\\": 2, \\\"next_max\\\": 2, \\\"ltor\\\": 6, \\\"rtol\\\": 7, \\\"max1\\\": 29, \\\"argsort\\\": 3, \\\"A2\\\": 5, \\\"max2\\\": 31, \\\"maxIndex\\\": 3, \\\"k2\\\": 1, \\\"ruiseki1\\\": 4, \\\"ruiseki2\\\": 4, \\\"ll\\\": 5, \\\"insert\\\": 12, \\\"python\\\": 8, \\\"rli\\\": 1, \\\"m1\\\": 22, \\\"m2\\\": 26, \\\"la\\\": 3, \\\"li1\\\": 4, \\\"li2\\\": 4, \\\"open\\\": 3, \\\"kou\\\": 4, \\\"#134\\\": 1, \\\"A_max_s\\\": 5, \\\"flag\\\": 50, \\\"ind_max\\\": 2, \\\"amax\\\": 9, \\\"amax2\\\": 2, \\\"a_sorted\\\": 3, \\\"a_sec\\\": 2, \\\"max_index\\\": 12, \\\"a_second\\\": 2, \\\"delete\\\": 3, \\\"nList\\\": 3, \\\"ansList\\\": 4, \\\"I\\\": 12, \\\"I2\\\": 1, \\\"Lx\\\": 1, \\\"new_A\\\": 3, \\\"a_list\\\": 24, \\\"i_max\\\": 5, \\\"i_max2\\\": 4, \\\"a_max2\\\": 4, \\\"ans1\\\": 45, \\\"ans2\\\": 57, \\\"nf\\\": 2, \\\"\\\\\\\"\\\\\\\"\\\\\\\"\\\\n\\\": 1, \\\"\\\\u5165\\\\u529b\\\\u5168\\\\u3066(EOF\\\\u307e\\\\u3067)\\\\u3092`int\\\": 1, \\\"iter`\\\\u306b\\\\u5909\\\\u63db\\\\n\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"read\\\": 2, \\\"alist\\\": 16, \\\"max_i\\\": 4, \\\"sA\\\": 6, \\\"firstA\\\": 4, \\\"secondA\\\": 3, \\\"maxvalue\\\": 2, \\\"maxindex\\\": 6, \\\"a_tmp\\\": 3, \\\"sort_a\\\": 3, \\\"max_a_1\\\": 2, \\\"first\\\": 12, \\\"1e9\\\": 2, \\\"max_A\\\": 3, \\\"next_A\\\": 2, \\\"[INT()\\\": 1, \\\"range(n)]\\\": 2, \\\"print(a)\\\": 4, \\\"range(n):\\\": 2, \\\"j:\\\": 1, \\\"l.append(a[j])\\\": 1, \\\"print(max(l))\\\": 2, \\\"print(l)\\\": 1, \\\"print(a[0:i],\\\": 1, \\\"a[i:n])\\\": 1, \\\"print(ans)\\\": 1, \\\"_collections\\\": 1, \\\"mapInt\\\": 2, \\\"stringList\\\": 1, \\\"intListList\\\": 1, \\\"intColsList\\\": 2, \\\"Math\\\": 4, \\\"roundUp\\\": 2, \\\"toUpperMultiple\\\": 1, \\\"toLowerMultiple\\\": 1, \\\"nearPow2\\\": 1, \\\"<<=\\\": 1, \\\">>=\\\": 2, \\\"1e09\\\": 1, \\\"dic_lst\\\": 7, \\\"max_num\\\": 11, \\\"a_s\\\": 4, \\\"escape\\\": 2, \\\"compare\\\": 3, \\\"max_b\\\": 2, \\\"ma1\\\": 4, \\\"aa1\\\": 2, \\\"maxa\\\": 6, \\\"#coding\\\": 1, \\\"except_i\\\": 2, \\\"calc\\\": 2, \\\"Amax\\\": 10, \\\"lmax\\\": 4, \\\"rmax\\\": 4, \\\"max_all\\\": 5, \\\"max_pop\\\": 2, \\\"inpur\\\": 1, \\\"lis\\\": 7, \\\"A_second\\\": 5, \\\"cont\\\": 2, \\\"info\\\": 3, \\\"info2\\\": 3, \\\"A_list\\\": 7, \\\"sort_A\\\": 9, \\\"_list\\\": 6, \\\"maxi\\\": 1, \\\"tmp_list\\\": 7, \\\"tmp_max\\\": 2, \\\"max_itr\\\": 3, \\\"max_number\\\": 3, \\\"M1\\\": 3, \\\"M2\\\": 3, \\\"max_val\\\": 10, \\\"input_val\\\": 7, \\\"remA\\\": 2, \\\"hoge\\\": 12, \\\"huga\\\": 8, \\\"temp\\\": 39, \\\"seq2\\\": 4, \\\"n1\\\": 13, \\\"n2\\\": 10, \\\"anoA\\\": 4, \\\"mA\\\": 6, \\\"#print(A)\\\": 1, \\\"f\\\": 13, \\\"A_sort\\\": 2, \\\"#print(max_index)\\\": 1, \\\"forward\\\": 6, \\\"backward\\\": 6, \\\"print(forward)\\\": 1, \\\"print(backward)\\\": 1, \\\"print(\\\\\\\"====\\\\\\\")\\\": 1, \\\"print(forward[n-1],backward[n+1])\\\": 1, \\\"l_max\\\": 6, \\\"l1\\\": 9, \\\"sec\\\": 9, \\\"#n,k\\\": 1, \\\"list(map(int,input().split(\\\\\\\"\\\": 2, \\\"\\\\\\\")))\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"n\\\": 1, \\\"int(input())\\\\nprint(3*(n*n))\\\\n\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"\\\\nimport\\\": 1, \\\"m\\\\nN,D\\\": 1, \\\"\\\\\\\")))\\\\nprint(m.ceil(N\\\": 1, \\\"/\\\": 563, \\\"(2*D+1)))\\\\n\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"Ai\\\": 3, \\\"Bs\\\": 5, \\\"#max(nums)\\\": 1, \\\"#max(nums.remove(max_num))\\\": 1, \\\"max2_ind\\\": 2, \\\"X\\\": 35, \\\"arg\\\": 4, \\\"others\\\": 3, \\\"_max\\\": 4, \\\"maxx\\\": 5, \\\"AS\\\": 4, \\\"A_sorted\\\": 5, \\\"vmax\\\": 3, \\\"vmax2\\\": 2, \\\"mx\\\": 3, \\\"#print(a)\\\": 1, \\\"#print(aa)\\\": 1, \\\"maxcnt\\\": 4, \\\"maxidx\\\": 4, \\\"Y\\\": 33, \\\"Ap\\\": 4, \\\"maxim\\\": 4, \\\"xx\\\": 4, \\\"a_L\\\": 4, \\\"val\\\": 11, \\\"s_L\\\": 4, \\\"maxValue\\\": 4, \\\"r2\\\": 3, \\\"nextValue\\\": 2, \\\"item\\\": 11, \\\"saidai\\\": 3, \\\"nibanme\\\": 2, \\\"argFst\\\": 2, \\\"b_list\\\": 4, \\\"a_lst\\\": 5, \\\"sorted_a_lst\\\": 2, \\\"A_cp\\\": 3, \\\"max1_A\\\": 3, \\\"max2_A\\\": 2, \\\"nlargest\\\": 1, \\\"#remove\\\": 1, \\\"duplicate\\\": 1, \\\"sorted_a\\\": 3, \\\"max_list\\\": 10, \\\"'''\\\": 1, \\\"\\\\n------------------------\\\\nauthor\\\": 1, \\\"iiou16\\\\n------------------------\\\\n'''\\\": 1, \\\"ii\\\": 3, \\\"maxn\\\": 1, \\\"fastinput\\\": 3, \\\"First\\\": 9, \\\"Second\\\": 6, \\\"Findex\\\": 1, \\\"max_cnt\\\": 2, \\\"submit\\\": 2, \\\"Alist\\\": 5, \\\"L_sort\\\": 4, \\\"m_1\\\": 5, \\\"m_2\\\": 3, \\\"#mx\\\": 1, \\\"-10000\\\": 1, \\\"A_Max\\\": 3, \\\"A_2nd\\\": 2, \\\"lists\\\": 7, \\\"newlist\\\": 4, \\\"largest_index\\\": 2, \\\"AC\\\": 3, \\\"A_bk\\\": 3, \\\"max_list_r\\\": 2, \\\"idxs\\\": 3, \\\"idx\\\": 26, \\\"Your\\\": 8, \\\"code\\\": 10, \\\"here!\\\": 8, \\\"sa\\\": 2, \\\"ma_2\\\": 3, \\\"n_ma\\\": 4, \\\"target\\\": 3, \\\"\\\\u3067\\\\u3064oO(YOU\\\": 1, \\\"PLAY\\\": 1, \\\"WITH\\\": 1, \\\"THE\\\": 1, \\\"CARDS\\\": 1, \\\"YOU'RE\\\": 1, \\\"DEALT..)\\\": 1, \\\"W\\\": 560, \\\"H\\\": 573, \\\"h\\\": 429, \\\"center\\\": 2, \\\"width\\\": 2, \\\"height\\\": 2, \\\"menseki_1\\\": 4, \\\"menseki_2\\\": 4, \\\"menseki\\\": 14, \\\"\\\\\\\"{:.9f}\\\\\\\"\\\": 4, \\\"menseki_2>menseki_1\\\": 1, \\\"width==W/2:\\\": 1, \\\"print(\\\\\\\"{:.9f}\\\\\\\".format(menseki),\\\": 1, \\\"'1')\\\": 1, \\\"readints\\\": 1, \\\"nCr\\\": 1, \\\"has_duplicates2\\\": 1, \\\"seen\\\": 4, \\\"divisor\\\": 8, \\\"coordinates\\\": 1, \\\"dx\\\": 1, \\\"dy\\\": 1, \\\"'{:f}'\\\": 2, \\\"AtCoder\\\": 3, \\\"Beginner\\\": 3, \\\"Contest\\\": 3, \\\"130\\\": 2, \\\"C\\\": 22, \\\"Rectangle\\\": 4, \\\"Cutting\\\": 4, \\\"2.0000\\\": 2, \\\"d1\\\": 2, \\\"d2\\\": 2, \\\"mi1\\\": 5, \\\"d3\\\": 2, \\\"d4\\\": 2, \\\"mi2\\\": 4, \\\"candidate1\\\": 3, \\\"candidate2\\\": 3, \\\"min1\\\": 17, \\\"min2\\\": 17, \\\"max12\\\": 2, \\\"way\\\": 3, \\\"3\\\": 50, \\\"0\\\\\\\"\\\": 11, \\\"ans_1\\\": 19, \\\"ans_2\\\": 14, \\\"1\\\\\\\"\\\": 5, \\\"W_harf\\\": 3, \\\"H_harf\\\": 2, \\\"a_sub\\\": 3, \\\"b_sub\\\": 3, \\\"x_test\\\": 4, \\\"y_test\\\": 4, \\\"x_cent\\\": 6, \\\"y_cent\\\": 6, \\\"s3\\\": 8, \\\"s4\\\": 8, \\\"'\\\": 214, \\\"'{}\\\": 12, \\\"{}'\\\": 15, \\\"2.0\\\": 32, \\\"area_ans\\\": 4, \\\"cog_x\\\": 3, \\\"cog_y\\\": 3, \\\"cog_ans\\\": 6, \\\"dou\\\": 3, \\\"is_double\\\": 6, \\\"res2\\\": 8, \\\"res3\\\": 5, \\\"\\\\\\\"{}\\\": 11, \\\"{}\\\\\\\"\\\": 13, \\\"x1\\\": 9, \\\"x2\\\": 5, \\\"y1\\\": 7, \\\"y2\\\": 5, \\\"h_i\\\": 2, \\\"w_i\\\": 3, \\\"\\\\u4e09\\\\u89d2\\\\u5f62(0,\\\": 2, \\\"w,\\\": 1, \\\"y)\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"#t_wy\\\": 1, \\\"(w_i*y)\\\": 1, \\\"x,\\\": 2, \\\"h)\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"#t_xh\\\": 1, \\\"(x*h_i)\\\": 1, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"s_wy\\\": 2, \\\"s_xh\\\": 2, \\\"extend\\\": 4, \\\"#print('w\\\\u306e\\\\u9762\\\\u7a4d',\\\": 1, \\\"t_wy)\\\": 1, \\\"#print('h\\\\u306e\\\\u9762\\\\u7a4d',\\\": 1, \\\"t_xh)\\\": 1, \\\"#print('w\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62',\\\": 1, \\\"s_wy)\\\": 1, \\\"#print('h\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62',\\\": 1, \\\"s_xh)\\\": 1, \\\"#print('w,\\\": 1, \\\"h',\\\": 1, \\\"w_i,\\\": 1, \\\"h_i)\\\": 1, \\\"max\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\": 1, \\\"full_w\\\": 4, \\\"full_h\\\": 5, \\\"multi\\\": 5, \\\"max_area\\\": 6, \\\"'{0}\\\": 4, \\\"{1}'\\\": 2, \\\"2019/06/16\\\": 1, \\\"Input\\\": 4, \\\"Case\\\": 3, \\\"\\\\\\\"|\\\\\\\"\\\": 1, \\\"lsq\\\": 2, \\\"rsq\\\": 2, \\\"wk1\\\": 3, \\\"\\\\\\\"-\\\\\\\"\\\": 1, \\\"usq\\\": 2, \\\"dsq\\\": 2, \\\"wk2\\\": 3, \\\"Equal\\\": 1, \\\"(h\\\": 2, \\\"y)\\\": 8, \\\"(w\\\": 2, \\\"x)\\\": 1, \\\"w:\\\": 1, \\\"h)\\\": 1, \\\"Output\\\": 1, \\\"dx1\\\": 6, \\\"dx2\\\": 6, \\\"dy1\\\": 6, \\\"dy2\\\": 6, \\\"'%f\\\": 8, \\\"%d'\\\": 2, \\\"LI\\\": 3, \\\"LS\\\": 2, \\\"area\\\": 66, \\\"H:\\\": 1, \\\"sq\\\": 9, \\\"nearX\\\": 3, \\\"nearY\\\": 3, \\\"1'\\\": 3, \\\"print('a')\\\": 1, \\\"dup\\\": 2, \\\"s_dup\\\": 2, \\\"\\\\\\\"{:.10f}\\\\\\\"\\\": 4, \\\"X==W//2\\\": 1, \\\"Y==H//2:\\\": 1, \\\"tmp1\\\": 8, \\\"tmp2\\\": 8, \\\"J\\\": 3, \\\"x_input\\\": 4, \\\"makey\\\": 2, \\\"is_only\\\": 5, \\\"xeven\\\": 2, \\\"yeven\\\": 2, \\\"s_11\\\": 2, \\\"s_12\\\": 2, \\\"S1\\\": 15, \\\"s_21\\\": 2, \\\"s_22\\\": 2, \\\"S2\\\": 13, \\\"\\\\\\\"{0}\\\": 5, \\\"{1}\\\\\\\"\\\": 5, \\\"horizon\\\": 3, \\\"vertical\\\": 2, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u5b58\\\\u5728\\\\u3059\\\\u308c\\\\u3070\\\\u4e09\\\\u89d2\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"\\\\\\\"{:.6f}\\\\\\\"\\\": 5, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u306a\\\\u3044\\\\u6642\\\": 1, \\\"'{:.6f}'\\\": 15, \\\"#if\\\": 1, \\\"vertical:\\\": 1, \\\"square\\\": 2, \\\"\\\\u3000\\\": 2, \\\"0'\\\": 2, \\\"decimal\\\": 2, \\\"\\\\\\\"{0:.9f}\\\\\\\"\\\": 2, \\\"6\\\": 21, \\\"nn\\\": 1, \\\"y_s1\\\": 2, \\\"y_s2\\\": 2, \\\"x_s1\\\": 2, \\\"x_s2\\\": 2, \\\"split_y\\\": 2, \\\"split_x\\\": 2, \\\"\\\\u554f\\\\u984c\\\\uff1ahttps://atcoder.jp/contests/abc126/tasks/abc130_c\\\": 1, \\\"has_points\\\": 3, \\\"result2\\\": 3, \\\"0.5\\\": 16, \\\"max_s\\\": 10, \\\"\\\\\\\"\\\\\\\"\\\\\\\"else:\\\\n\\\": 1, \\\"print(max(min(x*H,(W-x)*H),min(y*W,(H-y)*W),min(H*H*x/y,H*W-H*H*x/y),min(W*W*y/x,H*W-W*W*y/x)),0)\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"tate1\\\": 8, \\\"tate2\\\": 8, \\\"yoko1\\\": 7, \\\"yoko2\\\": 7, \\\"mi\\\": 2, \\\"hantei\\\": 3, \\\"SQs\\\": 1, \\\"4\\\": 8, \\\"another\\\": 3, \\\"Fraction\\\": 3, \\\"RectangleCutting\\\": 2, \\\"hs\\\": 2, \\\"__on_lines\\\": 2, \\\"sv\\\": 6, \\\"__separate_straight\\\": 2, \\\"is_on_line\\\": 4, \\\"line0\\\\u306e\\\\u50be\\\\u304d\\\": 1, \\\"a0\\\": 2, \\\"line1\\\\u306e\\\\u50be\\\\u304d\\\": 1, \\\"\\\\u7dda\\\\u4e0a\\\\u306b\\\\u3042\\\\u308b\\\\u6642,\\\": 1, \\\"2\\\\u7b49\\\\u5206\\\\u53ef\\\\u80fd\\\": 1, \\\"line0\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\": 1, \\\"line1\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\": 1, \\\"\\\\u7e26\\\\u6a2a\\\\u3067\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\": 1, \\\"\\\\u7e26\\\": 1, \\\"\\\\u6a2a\\\": 1, \\\"sh\\\": 4, \\\"rectangleCutting\\\": 2, \\\"DEBUG\\\": 2, \\\"read_int_list\\\": 2, \\\"read_int\\\": 1, \\\"dprint\\\": 1, \\\"args\\\": 3, \\\"kwargs\\\": 2, \\\"nr_ans\\\": 3, \\\"center_point\\\": 3, \\\"1e-9\\\": 2, \\\"\\\\\\\"%f\\\": 10, \\\"%d\\\\\\\"\\\": 4, \\\"#\\\\u518d\\\\u5e30\\\\u95a2\\\\u6570\\\\u306e\\\\u4e0a\\\\u9650,10**5\\\\u4ee5\\\\u4e0a\\\\u306e\\\\u5834\\\\u5408python\\\": 1, \\\"dcp\\\": 1, \\\"bisect_right\\\": 4, \\\"#2\\\\u5206\\\\u63a2\\\\u7d22\\\": 1, \\\"#bisect_left(l,x),\\\": 1, \\\"bisect(l,x)#a\\\\u306f\\\\u30bd\\\\u30fc\\\\u30c8\\\\u6e08\\\\u307f\\\\u3067\\\\u3042\\\\u308b\\\\u5fc5\\\\u8981\\\\u3042\\\\u308a\\\\u3002a\\\\u306e\\\\u4e2d\\\\u304b\\\\u3089x\\\\u672a\\\\u6e80\\\\u306e\\\\u8981\\\\u7d20\\\\u6570\\\\u3092\\\\u8fd4\\\\u3059\\\\u3002right\\\\u3060\\\\u3068\\\\u4ee5\\\\u4e0b\\\": 1, \\\"#deque(l),\\\": 1, \\\"pop(),\\\": 1, \\\"append(x),\\\": 1, \\\"popleft(),\\\": 1, \\\"appendleft(x)\\\": 1, \\\"#q.rotate(n)\\\\u3067\\\": 1, \\\"\\\\u2192\\\": 1, \\\"\\\\u306bn\\\\u56de\\\\u30ed\\\\u30fc\\\\u30c6\\\\u30fc\\\\u30c8\\\": 1, \\\"#\\\\u6587\\\\u5b57\\\\u5217\\\\u3092\\\\u500b\\\\u6570\\\\u30ab\\\\u30a6\\\\u30f3\\\\u30c8\\\\u8f9e\\\\u66f8\\\\u306b\\\\u3001\\\": 1, \\\"#S=Counter(l),S.most_common(x),S.keys(),S.values(),S.items()\\\": 1, \\\"#\\\\u7d2f\\\\u7a4d\\\\u548c\\\": 1, \\\"#list(accumulate(l))\\\": 1, \\\"#heapify(q),heappush(q,a),heappop(q)\\\": 1, \\\"#q=heapify(q)\\\\u3068\\\\u3057\\\\u306a\\\\u3044\\\\u3053\\\\u3068\\\\u3001\\\\u8fd4\\\\u308a\\\\u5024\\\\u306fNone\\\": 1, \\\"fractions#\\\\u53e4\\\\u3044atcoder\\\\u30b3\\\\u30f3\\\\u30c6\\\\u30b9\\\\u30c8\\\\u306e\\\\u5834\\\\u5408GCD\\\\u306a\\\\u3069\\\\u306f\\\\u3053\\\\u3053\\\\u304b\\\\u3089import\\\\u3059\\\\u308b\\\": 1, \\\"#pypy\\\\u3067\\\\u3082\\\\u3046\\\\u3054\\\\u304f\\\": 1, \\\"#@lru_cache(maxsize\\\": 1, \\\"None)#maxsize\\\\u306f\\\\u4fdd\\\\u5b58\\\\u3059\\\\u308b\\\\u30c7\\\\u30fc\\\\u30bf\\\\u6570\\\\u306e\\\\u6700\\\\u5927\\\\u5024\\\\u30012**n\\\\u304c\\\\u6700\\\\u3082\\\\u9ad8\\\\u52b9\\\\u7387\\\": 1, \\\"Decimal\\\": 3, \\\"printe\\\": 1, \\\"\\\\\\\"##\\\": 1, \\\"file\\\": 1, \\\"stderr\\\": 1, \\\"printl\\\": 1, \\\"return_sorted\\\": 2, \\\"inds\\\": 4, \\\"alp2num\\\": 1, \\\"cap\\\": 4, \\\"ord\\\": 4, \\\"97\\\": 2, \\\"65\\\": 2, \\\"num2alp\\\": 1, \\\"matmat\\\": 1, \\\"K\\\": 7, \\\"matvec\\\": 1, \\\"1000000007\\\": 2, \\\"#w.sort(key=itemgetter(1),reverse=True)\\\": 1, \\\"#\\\\u4e8c\\\\u500b\\\\u76ee\\\\u306e\\\\u8981\\\\u7d20\\\\u3067\\\\u964d\\\\u9806\\\\u4e26\\\\u3073\\\\u66ff\\\\u3048\\\": 1, \\\"#N\\\": 1, \\\"int(input())\\\": 2, \\\"#A\\\": 1, \\\"tuple(map(int,\\\": 1, \\\"input().split()))\\\": 3, \\\"#1\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"#L\\\": 1, \\\"tuple(int(input())\\\": 1, \\\"range(N))\\\": 2, \\\"#\\\\u6539\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"#S\\\": 1, \\\"tuple(tuple(map(int,\\\": 1, \\\"#\\\\u6539\\\\u884c\\\\u884c\\\\u5217\\\": 1, \\\"half\\\": 5, \\\"\\\\\\\"{0:6f}\\\\\\\"\\\": 1, \\\"check\\\": 6, \\\"min_1\\\": 4, \\\"min_2\\\": 3, \\\"'{:.6f}\\\": 5, \\\"#ABC130\\\": 1, \\\"is_center\\\": 3, \\\"is_on_axis\\\": 2, \\\"any\\\": 1, \\\"#\\\\u9577\\\\u65b9\\\\u5f62\\\\u5185\\\\u3067\\\\u3042\\\\u308c\\\\u3070\\\\u3001\\\\u4e2d\\\\u5fc3\\\\u304b\\\\u3089\\\\u306e\\\\u5bfe\\\\u8c61\\\\u70b9\\\\u3092\\\\u9078\\\\u3076\\\\u4e8b\\\\u306b\\\\u3088\\\\u308a\\\\u30012\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"#\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u30012\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\\u3002\\\\u305d\\\\u3046\\\\u3058\\\\u3083\\\\u306a\\\\u3044\\\\u3068\\\\u3060\\\\u3081\\\": 1, \\\"'{:6f}'\\\": 5, \\\"LD\\\": 3, \\\"LU\\\": 3, \\\"RD\\\": 3, \\\"RU\\\": 3, \\\"U\\\": 5, \\\"minS\\\": 2, \\\"pprint\\\": 3, \\\"LF\\\": 1, \\\"MI\\\": 2, \\\"II\\\": 1, \\\"IS\\\": 1, \\\"GCD_LIST\\\": 1, \\\"LCM_LIST\\\": 1, \\\"LCM\\\": 2, \\\"halfw\\\": 2, \\\"halfh\\\": 2, \\\"ansx\\\": 6, \\\"ansy\\\": 4, \\\"ans_men\\\": 3, \\\"dif\\\": 3, \\\"'{:.9f}\\\": 3, \\\"ABC130C\\\": 1, \\\"Sm\\\": 4, \\\"co\\\": 4, \\\"buf_x\\\": 3, \\\"buf_y\\\": 3, \\\"ver_area\\\": 5, \\\"hori_area\\\": 4, \\\"bunkatsu\\\": 3, \\\"x0\\\": 3, \\\"y0\\\": 3, \\\"check1\\\": 2, \\\"check2\\\": 2, \\\"X1\\\": 2, \\\"X2\\\": 2, \\\"Y1\\\": 2, \\\"Y2\\\": 2, \\\"cenx\\\": 2, \\\"ceny\\\": 2, \\\"'''\\\\n\\\\u9577\\\\u65b9\\\\u5f62\\\\u3092\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\\u305f\\\\u3081\\\\u306b\\\\u306f\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308b\\\\u5fc5\\\\u8981\\\\u304c\\\\u3042\\\\u308b\\\\n\\\\u305f\\\\u3060\\\\u3057\\\\u3001\\\\u6307\\\\u5b9a\\\\u3055\\\\u308c\\\\u305f\\\\u5ea7\\\\u6a19\\\\u304c\\\\u4e2d\\\\u5fc3\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u7121\\\\u9650\\\\u306b\\\\u76f4\\\\u7dda\\\\u304c\\\\u5f3e\\\\u3051\\\\u308b\\\\n'''\\\": 1, \\\"1000000\\\": 4, \\\"ABC130\\\": 1, \\\"rectangle\\\": 3, \\\"10000\\\": 6, \\\"\\\\\\\"inf\\\\\\\"\\\": 1, \\\"YES\\\": 2, \\\"Yes\\\": 2, \\\"yes\\\": 1, \\\"NO\\\": 2, \\\"No\\\": 2, \\\"no\\\": 1, \\\"dy4\\\": 1, \\\"dx4\\\": 1, \\\"dy8\\\": 1, \\\"dx8\\\": 1, \\\"inside\\\": 1, \\\"\\\\u521d\\\\u9805s,\\\": 1, \\\"\\\\u4ea4\\\\u5deed\\\\u306en\\\\u500b\\\\u306e\\\\u6570\\\\u5217\\\\u306e\\\\u548c\\\": 1, \\\"sum_of_arithmetic_progression\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5c0f\\\\u516c\\\\u500d\\\\u6570\\\": 1, \\\"g\\\": 5, \\\"c_x\\\": 2, \\\"c_y\\\": 2, \\\"#min(a,b)\\\": 1, \\\"Tue\\\": 1, \\\"May\\\": 1, \\\"12\\\": 1, \\\"00:13:44\\\": 1, \\\"shinba\\\\n\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"#print(y/x,h/w,y/(w-x))\\\": 1, \\\"counter\\\": 4, \\\"\\\\\\\"{:.10f}\\\": 2, \\\"min_x\\\": 3, \\\"min_y\\\": 3, \\\"areas\\\": 5, \\\"area_a\\\": 4, \\\"area_b\\\": 4, \\\"cond\\\": 3, \\\"pat\\\": 3, \\\"area_H\\\": 4, \\\"area_V\\\": 4, \\\"#print(W,H,x,y)\\\": 1, \\\"#\\\\u6a2a\\\\u306b\\\\u30e9\\\\u30a4\\\\u30f3\\\\u3092\\\\u5f15\\\\u304f\\\": 1, \\\"tatemax\\\": 8, \\\"yokomax\\\": 8, \\\"'{:.12e}'\\\": 2, \\\"a_x\\\": 8, \\\"a_y\\\": 8, \\\"multi_ans\\\": 9, \\\"\\\\u5bfe\\\\u89d2\\\\u7dda\\\": 1, \\\"4\\\\u70b9\\\": 1, \\\"res1\\\": 3, \\\"tate\\\": 3, \\\"yoko\\\": 3, \\\"\\\\u771f\\\\u3093\\\\u4e2d\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u5fc5\\\\u305a\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u3066\\\\u3053\\\\u308c\\\\u304c\\\\u6700\\\\u5927\\\\u5024\\\\u3060\\\\u304c\\\\u3001\\\\u81ea\\\\u5206\\\\u81ea\\\\u8eab\\\\u304c\\\\u771f\\\\u3093\\\\u4e2d\\\\u306e\\\\u5ea7\\\\u6a19\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u81ea\\\\u5206\\\\u81ea\\\\u4fe1\\\\u3092\\\\u901a\\\\u308b\\\\u3069\\\\u3093\\\\u306a\\\\u76f4\\\\u7dda\\\\u3082\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"\\\\\\\"0.000000\\\": 1, \\\"Num\\\": 21, \\\"Result1\\\": 7, \\\"Result2\\\": 1, \\\"Mem1\\\": 4, \\\"Mem2\\\": 4, \\\"#ABC130C\\\": 1, \\\"\\\\\\\"{:.11f}\\\\\\\"\\\": 2, \\\"quit\\\": 1, \\\"whxy\\\": 9, \\\"temp1\\\": 3, \\\"temp2\\\": 3, \\\"ignore\\\": 1, \\\"trailing\\\": 1, \\\"spaces\\\": 1, \\\"WS\\\": 3, \\\"HS\\\": 3, \\\"1e-6\\\": 4, \\\"(x,\\\": 3, \\\"y)==(W,\\\": 2, \\\"0)\\\": 1, \\\"H)\\\": 1, \\\"y)==(0,\\\": 1, \\\"H):\\\": 1, \\\"W*H/2\\\": 1, \\\"x_u\\\": 2, \\\"x_d\\\": 2, \\\"x_pat\\\": 4, \\\"y_u\\\": 3, \\\"y_d\\\": 1, \\\"y_pat\\\": 4, \\\"pirnt\\\": 1, \\\"xyplus\\\": 1, \\\"#\\\\u91cd\\\\u5fc3\\\\u306b\\\\u6765\\\\u308b\\\\u6642\\\\u306f\\\\u8907\\\\u6570\\\\u3001\\\\u7dda\\\\u4e0a\\\\u3068\\\\u5185\\\\u90e8\\\\u306f1\\\\u3053\\\": 1, \\\"0:\\\": 1, \\\"ans_area\\\": 2, \\\"ans_sp\\\": 3, \\\"2.\\\": 1, \\\"line\\\": 111, \\\"divide\\\": 41, \\\"x_y_divisor\\\": 3, \\\"y_divisor\\\": 5, \\\"x_mod_y\\\": 3, \\\"x_y_divisor_set\\\": 2, \\\"y_divisor_set\\\": 2, \\\"ans_divisor\\\": 2, \\\"intersection\\\": 4, \\\"ALDS1_1_B\\\": 1, \\\"Greatest\\\": 1, \\\"Common\\\": 3, \\\"Divisor\\\": 1, \\\"->\\\": 2, \\\"\\\\\\\"a:\\\\\\\"\\\": 1, \\\"\\\\\\\"b:\\\\\\\"\\\": 1, \\\"a=max(a,\\\": 1, \\\"b)\\\": 1, \\\"b=min(a,\\\": 1, \\\"b)?????\\\\u00a8??????????????????????????????\\\": 1, \\\"???????????????????????????a1=30,\\\": 1, \\\"b1=100??????a2=b1=100,\\\": 1, \\\"b2=r1=30??\\\\u00a8???????????\\\\u00a7?\\\\u00b0???\\\\\\\\???????????????\\\": 1, \\\"00.02\\\": 2, \\\"5588\\\": 3, \\\"KB\\\": 3, \\\"lines\\\": 5, \\\"55\\\": 3, \\\"bytes\\\": 1, \\\"a,b=map(int,input().split())\\\": 1, \\\"b:a,b=b,a%b\\\": 1, \\\"greatest_common_divisor\\\": 5, \\\"###??????x\\\": 1, \\\"b1\\\": 2, \\\"\\\\\\\"a\\\": 1, \\\"={},\\\": 1, \\\"dbg\\\": 4, \\\"gcd_tmp\\\": 8, \\\"print(r)\\\": 1, \\\"ex\\\": 2, \\\"n_s\\\": 5, \\\"m_s\\\": 2, \\\"print(x,\\\": 2, \\\"lg\\\": 3, \\\"sm\\\": 5, \\\"div\\\": 7, \\\"lg_temp\\\": 3, \\\"a_cd\\\": 4, \\\"#include<stdio.h>\\\": 1, \\\"void\\\": 2, \\\"scanf\\\": 2, \\\"\\\\\\\"%d\\\\\\\"\\\": 8, \\\"printf\\\": 1, \\\"\\\\\\\"%d\\\\\\\\n\\\\\\\"\\\": 3, \\\"mygcd\\\": 3, \\\"'%d\\\": 2, \\\"#print(gcd(x,\\\": 1, \\\"y))\\\": 1, \\\"Z\\\": 3, \\\"gcm\\\": 4, \\\"converter\\\": 6, \\\"ext\\\": 3, \\\"getResult\\\": 2, \\\"xy\\\": 3, \\\"Euclid\\\": 2, \\\"natural\\\": 4, \\\"java\\\": 1, \\\"util\\\": 1, \\\"Scanner\\\": 3, \\\"public\\\": 3, \\\"Main\\\": 1, \\\"static\\\": 2, \\\"String\\\": 1, \\\"scanner\\\": 4, \\\"System\\\": 2, \\\"nextInt\\\": 2, \\\"close\\\": 1, \\\"println\\\": 1, \\\"helper\\\": 3, \\\"#print(f\\\\\\\"{x}\\\": 1, \\\"{y}\\\\\\\")\\\": 1, \\\"#swap(\\\\u6700\\\\u521d\\\\u306b\\\\u78ba\\\\u8a8d\\\\u306eswap)\\\": 1, \\\"#(\\\\u6bce\\\\u56de\\\\u5165\\\\u308c\\\\u66ff\\\\u3048\\\\u308bawap)\\\": 1, \\\"long\\\": 2, \\\"x_divisor\\\": 2, \\\"common_divisor\\\": 3, \\\"to_xy\\\": 4, \\\"gc\\\": 4, \\\"x,y\\\": 1, \\\"y,x\\\": 1, \\\"\\\\u306fswap(\\\\u5024\\\\u306e\\\\u4ea4\\\\u63db)\\\\u3092\\\\u8868\\\\u3059\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\\u306b\\\\u3088\\\\u308a\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570:\\\": 1, \\\"GreatestCommonDivisor\\\\u3092\\\\u6c42\\\\u3081\\\\u308b\\\": 1, \\\"\\\\u4ee5\\\\u4e0b\\\\u306e\\\\u3088\\\\u3046\\\\u306a\\\\u30a2\\\\u30eb\\\\u30b4\\\\u30ea\\\\u30ba\\\\u30e0\\\\u306fn\\\\u56de\\\\u306e\\\\u5272\\\\u308a\\\\u7b97\\\\u3092\\\\u884c\\\\u3046\\\\u5fc5\\\\u8981\\\\u304c\\\\u3042\\\\u308b\\\\u305f\\\\u3081\\\\u3001\\\\u5927\\\\u304d\\\\u306a\\\\u6570\\\\u306b\\\\u5bfe\\\\u3057\\\\u3066\\\\u306f\\\\u6642\\\\u9593\\\\u5185\\\\u306b\\\\u51fa\\\\u529b\\\\u3092\\\\u5f97\\\\u308b\\\\u3053\\\\u3068\\\\u306f\\\\u3067\\\\u304d\\\\u306a\\\\u3044\\\": 1, \\\"gcd(x,\\\": 2, \\\"min(x,\\\": 1, \\\"downto\\\": 1, \\\"\\\\u3068\\\": 4, \\\"\\\\u304c\\\\u3068\\\\u3082\\\\u306b\\\": 1, \\\"\\\\u3067\\\\u5272\\\\u308a\\\\u5207\\\\u308c\\\\u308b\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\\u306b\\\\u3088\\\\u308b\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\\u306e\\\\u5224\\\\u5b9a\\\": 1, \\\"swap(x,\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\": 1, \\\"bq\\\": 1, \\\"74\\\": 1, \\\"54*1+20\\\": 1, \\\"54\\\": 1, \\\"20*2+14\\\": 1, \\\"14*1+6\\\": 1, \\\"14\\\": 1, \\\"6*2+2\\\": 1, \\\"2*3+0\\\": 1, \\\"\\\\u4e00\\\\u884c\\\\u306b\\\\u8907\\\\u6570\\\\u5165\\\\u529b\\\": 1, \\\"a,\\\": 1, \\\"map(int,\\\": 3, \\\"input().split())\\\": 2, \\\"\\\\u6a19\\\\u6e96\\\\u5165\\\\u529b\\\\u3092\\\\u884c\\\\u3046\\\": 1, \\\"33\\\": 2, \\\"66\\\": 2, \\\"print(b)\\\": 1, \\\"version_info\\\": 1, \\\"minor\\\": 1, \\\"5\\\": 8, \\\"list2d\\\": 1, \\\"list3d\\\": 1, \\\"x_y\\\": 7, \\\"xcd\\\": 2, \\\"x\\\\u306e\\\\u7d04\\\\u6570\\\": 1, \\\"ycd\\\": 2, \\\"y\\\\u306e\\\\u7d04\\\\u6570\\\": 1, \\\"cd\\\": 2, \\\"\\\\uff58\\\\u3068y\\\\u306e\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\uff58\\\\u3068y\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"'''\\\\n#\\\": 1, \\\"bytes\\\\na,b=map(int,input().split())\\\\nwhile\\\": 2, \\\"b:a,b=b,a%b\\\\nprint(a)\\\\n'''\\\": 2, \\\"larger\\\": 3, \\\"smaller\\\": 4, \\\"zzz\\\": 16, \\\"greatest_common_divisor3\\\": 3, \\\"yy\\\": 5, \\\"v1\\\": 4, \\\"#print(\\\\\\\"{}\\\": 1, \\\"{}\\\\\\\".format(yy,\\\": 1, \\\"v1))\\\": 1, \\\"TODO\\\": 1, \\\"XY\\\": 6, \\\"x_dy\\\": 5, \\\"#coding:\\\": 5, \\\"/=\\\": 3, \\\"greatestdivisor\\\": 2, \\\"slist\\\": 4, \\\"GCD\\\": 12, \\\"greatest_common_divider\\\": 2, \\\"euclideanAlg\\\": 3, \\\"bb\\\": 8, \\\"#print\\\": 2, \\\"a,b\\\": 2, \\\"calc_gcd\\\": 5, \\\"'{0}'\\\": 1, \\\"__future__\\\": 1, \\\"print_function\\\": 1, \\\"io\\\": 1, \\\"#start\\\": 1, \\\"time.clock()\\\": 1, \\\"#h,i\\\": 1, \\\"497,284\\\": 1, \\\"siki\\\": 2, \\\"Euclidean\\\": 3, \\\"_x\\\": 3, \\\"_y\\\": 3, \\\"maximum\\\": 4, \\\"31\\\": 1, \\\"29\\\": 1, \\\"23\\\": 1, \\\"19\\\": 1, \\\"17\\\": 1, \\\"13\\\": 1, \\\"x_ans\\\": 3, \\\"y_ans\\\": 7, \\\"xset\\\": 2, \\\"yset\\\": 4, \\\"matched\\\": 4, \\\"#\\\\u8a08\\\\u7b97\\\\u91cf\\\\u554f\\\\u984c\\\\u3042\\\\u308a\\\": 1, \\\"'''\\\\nfor\\\": 1, \\\"range(y):\\\\n\\\": 1, \\\"if(x%(y-i)==0)and(y%(y-i)==0):\\\\n\\\": 1, \\\"print(y-i)\\\\n\\\": 1, \\\"exit()\\\\n'''\\\": 1, \\\"small\\\": 9, \\\"big_i\\\": 6, \\\"herf\\\": 4, \\\"round\\\": 25, \\\"printArrLine\\\": 1, \\\"inputArrLine\\\": 2, \\\"ar\\\": 3, \\\"16D8101022L\\\": 1, \\\"\\\\u5c0f\\\\u6797\\\\u52c7\\\\u5e0c\\\": 1, \\\"ID:k_mb\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"\\\\n\\\\n\\\": 1, \\\"while(1):\\\\n\\\": 1, \\\"if(w\\\": 1, \\\"0):\\\\n\\\": 1, \\\"w\\\\n\\\": 1, \\\"z%w\\\\n\\\": 1, \\\"v\\\\n\\\": 1, \\\"else:\\\\n\\\": 1, \\\"print(z)\\\\n\\\": 1, \\\"break\\\\n\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"'''\\\\n00.02\\\": 1, \\\"y,\\\": 1, \\\"#GCD\\\": 1, \\\"x\\\\u306e\\\\u65b9\\\\u304c\\\\u5927\\\\u304d\\\\u304f\\\\u306a\\\\u304f\\\\u3066\\\\u306f\\\\u306a\\\\u3089\\\\u306a\\\\u3044\\\": 1, \\\"\\\\uff12\\\\u3064\\\\u306e\\\\u6574\\\\u6570\\\": 1, \\\"\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\\u3001x\\\": 1, \\\"\\\\u00f7\\\": 2, \\\"\\\\u306e\\\\u4f59\\\\u308a\\\\u304c\\\\u3068\\\\u3082\\\\u306b\\\": 1, \\\"\\\\u3068\\\\u306a\\\\u308b\\\": 1, \\\"\\\\u306e\\\\u3046\\\\u3061\\\\u6700\\\\u5927\\\\u306e\\\\u3082\\\\u306e\\\\u3092\\\\u3001x\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\\uff08Greatest\\\": 1, \\\"Divisor\\\\uff09\\\\u3068\\\\u8a00\\\\u3044\\\\u307e\\\\u3059\\\\u3002\\\": 1, \\\"\\\\u4f8b\\\\u3048\\\\u3070\\\\u300135\\\": 1, \\\"\\\\u306814\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"(35,\\\": 1, \\\"14)\\\": 1, \\\"\\\\u306f\\\": 1, \\\"\\\\u3068\\\\u306a\\\\u308a\\\\u307e\\\\u3059\\\\u3002\\\\u3053\\\\u308c\\\\u306f\\\\u300135\\\": 1, \\\"\\\\u306e\\\\u7d04\\\\u6570{1,\\\": 1, \\\"5,\\\": 1, \\\"7,\\\": 2, \\\"35}\\\\u300114\\\": 1, \\\"\\\\u306e\\\\u7d04\\\\u6570\\\": 1, \\\"{1,\\\": 2, \\\"2,\\\": 2, \\\"14}\\\": 1, \\\"\\\\u306e\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"7}\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u5024\\\\u3068\\\\u306a\\\\u308a\\\\u307e\\\\u3059\\\\u3002\\\": 1, \\\"147\\\": 1, \\\"42\\\": 3, \\\"21\\\": 2, \\\"#coding:UTF-8\\\": 1, \\\"stdinput\\\": 2, \\\"getGCM\\\": 2, \\\"min_xy\\\": 2, \\\"new_x\\\": 4, \\\"new_y\\\": 5, \\\"swap\\\": 1, \\\"two_ans\\\": 4, \\\"twoset\\\": 2, \\\"GCD(Greatest\\\": 1, \\\"Divisor)\\\": 1, \\\"3.141592653589793\\\": 4, \\\"100000\\\": 7, \\\"Circle\\\": 1, \\\"Import\\\": 1, \\\"math.py\\\": 1, \\\"radius\\\": 9, \\\"circumference\\\": 7, \\\"\\\\\\\"%.6f\\\": 8, \\\"%.6f\\\\\\\"\\\": 8, \\\"circle_area\\\": 8, \\\"circle_round\\\": 4, \\\"'{:.06f}'\\\": 6, \\\"3.14159265359\\\": 8, \\\"f\\\\\\\"{S:.6f}\\\": 1, \\\"{L:.6f}\\\\\\\"\\\": 1, \\\"3.14\\\": 8, \\\"PI\\\": 9, \\\"men\\\": 7, \\\"sen\\\": 4, \\\"'%.6f\\\": 2, \\\"%.6f'\\\": 3, \\\"Q\\\": 2, \\\"\\\\\\\"{0:6f}\\\": 1, \\\"{1:6f}\\\\\\\"\\\": 1, \\\"perimeter\\\": 2, \\\"'{0:.6f}\\\": 3, \\\"{1:.6f}'\\\": 4, \\\"py\\\": 3, \\\"3.141592653589793238462643383279\\\": 1, \\\"\\\\\\\"{:.7f}\\\": 1, \\\"{:.7f}\\\\\\\"\\\": 1, \\\"\\\\u9762\\\\u7a4d\\\": 1, \\\"\\\\u5186\\\\u5468\\\": 1, \\\"{:.6f}'\\\": 3, \\\"3.14159265\\\": 9, \\\"3.141592\\\": 5, \\\"\\\\\\\"%.5f\\\": 3, \\\"%.5f\\\\\\\"\\\": 3, \\\"'{:.8f}'\\\": 3, \\\"\\\\\\\"{0:.5f}\\\": 7, \\\"{1:.5f}\\\\\\\"\\\": 6, \\\"f'{math.pi*r*r:.6f}\\\": 1, \\\"{2*math.pi*r:.6f}'\\\": 1, \\\"3.141592653589\\\": 26, \\\"circle_squre\\\": 2, \\\"circle_length\\\": 4, \\\"'{:.5f}'\\\": 4, \\\"3.141592653589793238\\\": 1, \\\"'%.10f\\\": 2, \\\"%.10f'\\\": 2, \\\"shu\\\": 1, \\\"f\\\\\\\"{men:.5f}\\\": 1, \\\"{shu:.5f}\\\\\\\"\\\": 1, \\\"3.14159265358979\\\": 3, \\\"'{0:80.10f}'\\\": 2, \\\"\\\\\\\"{0:.6f}\\\\\\\"\\\": 6, \\\"'%.5f\\\": 4, \\\"%.5f'\\\": 4, \\\"sprit\\\": 1, \\\"%f\\\\\\\"\\\": 6, \\\"=[int(i)\\\": 1, \\\"input().split()]\\\": 4, \\\"#r=2\\\": 1, \\\"3.141592653\\\": 2, \\\"\\\\\\\"{0:.6f}\\\": 6, \\\"{1:.6f}\\\\\\\"\\\": 6, \\\"3.14159\\\": 4, \\\"3.14159265358979323846\\\": 4, \\\"{:.10f}\\\\\\\"\\\": 1, \\\"#coding:utf-8\\\": 4, \\\"3.14159265358\\\": 1, \\\"\\\\\\\"%.10f\\\": 2, \\\"%.10f\\\\\\\"\\\": 2, \\\"number\\\": 9, \\\"^\\\": 4, \\\"%f'\\\": 7, \\\"'{0:.6f}'\\\": 2, \\\"%.6\\\\\\\"\\\": 1, \\\"'%.7f\\\": 1, \\\"%.7f'\\\": 1, \\\"\\\\\\\"{:f}\\\": 2, \\\"{:f}\\\\\\\"\\\": 2, \\\"\\\\u5186\\\\u5468\\\\u7387\\\": 1, \\\"\\\\u6d6e\\\\u52d5\\\\u5c0f\\\\u6570\\\\u70b9\\\\u6570\\\\u3067\\\\u8aad\\\\u3080\\\": 1, \\\"cir\\\": 1, \\\"f'{(area):.6f}\\\": 1, \\\"{(cir):.6f}'\\\": 1, \\\"\\\\\\\"{:.6f}\\\": 2, \\\"{:.6f}\\\\\\\"\\\": 2, \\\"pie\\\": 2, \\\"f\\\\\\\"{S:.8f}\\\": 1, \\\"{L:8f}\\\\\\\"\\\": 1, \\\"'%.6f,\\\": 1, \\\"f\\\\\\\"{r**2*3.141592653589}\\\": 1, \\\"{2*r*3.141592653589:.5f}\\\\\\\"\\\": 1, \\\"calculate_circle\\\": 2, \\\"around\\\": 4, \\\"f\\\\\\\"{s:.30f}\\\": 1, \\\"{a:.30f}\\\\\\\"\\\": 1, \\\"f'{x:.6f}\\\": 1, \\\"{y:.6f}'\\\": 1, \\\"circle\\\": 7, \\\"en\\\": 3, \\\"'.5f'\\\": 4, \\\"\\\\\\\"%.6f\\\\\\\"\\\": 1, \\\"3.14159265358979324\\\": 1, \\\"r_\\\": 3, \\\"3.1415926535897\\\": 1, \\\"circle_long\\\": 1, \\\"f\\\\\\\"{S:6f}\\\": 1, \\\"{circle_long:.6f}\\\\\\\"\\\": 1, \\\"\\\\\\\"{0:.10f}\\\\\\\"\\\": 2, \\\"value\\\": 4, \\\"'%.6lf\\\": 1, \\\"%.6lf'\\\": 1, \\\"#include\\\": 2, \\\"<iostream>\\\": 1, \\\"<iomanip>\\\": 1, \\\"using\\\": 1, \\\"namespace\\\": 1, \\\"std\\\": 1, \\\"const\\\": 1, \\\"double\\\": 3, \\\"cout\\\": 1, \\\"fixed\\\": 1, \\\"setprecision\\\": 1, \\\"endl\\\": 1, \\\"are\\\": 2, \\\"f\\\\\\\"{s:.6f}\\\": 1, \\\"{l:.6f}\\\\\\\"\\\": 1, \\\"'%03.7f'\\\": 2, \\\"Area\\\": 2, \\\"Circumference\\\": 2, \\\"f'{r**2*math.pi:.5f}\\\": 1, \\\"{r*2*math.pi:.5f}'\\\": 1, \\\"3.1415926535\\\": 2, \\\"f'{(r\\\": 1, \\\"math.pi):.10f}'\\\": 2, \\\"f'{(2\\\": 1, \\\"###\\\": 1, \\\"20.07.2017\\\": 1, \\\"'%03.6f'\\\": 2, \\\"{1:5f}\\\\\\\"\\\": 1, \\\"f'{a:.06f}\\\": 1, \\\"{b:.06f}'\\\": 1, \\\"\\\\\\\"%.8f\\\": 2, \\\"%.8f\\\\\\\"\\\": 2, \\\"\\\\\\\"{:.8f}\\\\\\\"\\\": 2, \\\"355\\\": 1, \\\"113.0\\\": 1, \\\"f'{s:.6f}\\\": 1, \\\"{l:.6f}'\\\": 1, \\\"\\\\\\\"%.9f\\\\\\\"\\\": 1, \\\"'%.8f\\\": 1, \\\"%.8f'\\\": 1, \\\"\\\\\\\"{:.010f}{:.010f}\\\\\\\"\\\": 1, \\\"nag\\\": 2, \\\"#!/usr/bin/python\\\": 3, \\\"circum\\\": 2, \\\"f'{2\\\": 1, \\\"3.141592653589}'\\\": 2, \\\"f'{a\\\": 1, \\\"\\\\\\\"%f,%f\\\\\\\"\\\": 1, \\\"warnings\\\": 1, \\\"urllib2\\\": 1, \\\"#data\\\": 1, \\\"raw_input().split())\\\": 1, \\\"1.0\\\": 7, \\\"\\\\u03c0\\\": 3, \\\"ensyu\\\": 2, \\\"#????????\\\\u00a2?????\\\\u00a8??????\\\": 2, \\\"row_input\\\": 1, \\\"\\\\\\\"{0:f}\\\": 2, \\\"{1:f}\\\\\\\"\\\": 2, \\\"pai\\\": 3, \\\"\\\\\\\"{:0.6f}\\\": 1, \\\"{:0.6f}\\\\\\\"\\\": 1, \\\"Here\\\": 2, \\\"your\\\": 2, \\\"!\\\": 2, \\\"\\\\\\\"{0:.8f}\\\": 1, \\\"{1:.8f}\\\\\\\"\\\": 1, \\\"\\\\\\\"{:.010f}\\\": 2, \\\"{:.010f}\\\\\\\"\\\": 2, \\\"f\\\\\\\"{area}\\\": 1, \\\"{circumference}\\\\\\\"\\\": 1, \\\"froat\\\": 1, \\\"#!usr/bin/env\\\": 1, \\\"area_of_circle\\\": 2, \\\"circumference_of_circle\\\": 2, \\\"my_value\\\": 3, \\\"mennseki\\\": 2, \\\"ennsyuu\\\": 2, \\\"\\\\\\\"%06.6f\\\\\\\"\\\": 2, \\\"ITP1_6_A\\\": 1, \\\"\\\\\\\"{0}\\\\\\\"\\\": 3, \\\"cording\\\": 1, \\\"values\\\": 6, \\\"jun\\\": 2, \\\"gyaku\\\": 2, \\\"x_int\\\": 2, \\\"an\\\": 5, \\\"stdout\\\": 9, \\\"write\\\": 9, \\\"'%d'\\\": 1, \\\"table\\\": 18, \\\"ls\\\": 8, \\\"'_'\\\": 1, \\\"numlist\\\": 3, \\\"reversed_a_list\\\": 2, \\\"rx\\\": 2, \\\"ai\\\": 5, \\\"inp1\\\": 1, \\\"inp2\\\": 3, \\\"data_int\\\": 6, \\\"#42\\\": 1, \\\"\\\\u6570\\\\u5217\\\\u306e\\\\u53cd\\\\u8ee2\\\": 1, \\\"date\\\": 3, \\\"\\\\\\\",\\\\\\\"\\\": 1, \\\"elem\\\": 4, \\\"\\\\u304c\\\": 1, \\\"\\\\u3088\\\\u308a\\\\u5927\\\\u304d\\\\u3044\\\\u3068\\\\u304d\\\\u3001\\\\u3064\\\\u307e\\\\u308a\\\\u6700\\\\u521d\\\\u306e\\\\u8981\\\\u7d20\\\\u3067\\\\u306f\\\\u306a\\\\u3044\\\\u3068\\\\u304d\\\\u7a7a\\\\u767d\\\\u3092\\\\u51fa\\\\u529b\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u3092\\\\u51fa\\\\u529b\\\": 1, \\\"sute\\\": 1, \\\"*\\\\u306f\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u5f15\\\\u6570\\\\u306b\\\\u5c55\\\\u958b\\\": 1, \\\"print(ns[0],\\\": 1, \\\"ns[1],\\\": 1, \\\"...)\\\": 1, \\\"\\\\u2018\\\": 2, \\\"cn\\\": 4, \\\"list_a\\\": 3, \\\"num_list\\\": 6, \\\"reveres\\\": 1, \\\"#map(func,\\\": 1, \\\"iterable)\\\": 1, \\\"o\\\": 17, \\\"'{}'\\\": 3, \\\"iline\\\": 3, \\\"ilinei\\\": 4, \\\"/dev/null\\\": 1, \\\"it\\\": 3, \\\"xrange\\\": 1, \\\"input_data\\\": 5, \\\"#for\\\": 1, \\\"range(1,num):\\\": 1, \\\"#\\\\tprint(\\\\\\\"\\\": 1, \\\"{}\\\\\\\".format(input_data[i]),end='')\\\": 1, \\\"#print('\\\\\\\\n')\\\": 1, \\\"\\\\\\\"%d\\\": 1, \\\"UTF-8\\\": 2, \\\"[1,\\\": 1, \\\"65,\\\": 1, \\\"3,\\\": 1, \\\"5,8]\\\": 1, \\\"l_int\\\": 1, \\\"#a\\\": 1, \\\"[1,2,3,4,5]\\\": 1, \\\"#a_str\\\": 1, \\\"map(str,a)\\\": 1, \\\"\\\\\\\",\\\\\\\".join(a_str)\\\": 1, \\\"\\\\\\\"9\\\\\\\"\\\": 122, \\\"'9'\\\": 137, \\\"rev_s\\\": 2, \\\"\\\\\\\"@\\\\\\\"\\\": 2, \\\"'X'\\\": 4, \\\"\\\\\\\"2\\\\\\\"\\\": 3, \\\"n_str\\\": 2, \\\"new_s\\\": 3, \\\"1110\\\": 13, \\\"REPL\\\": 2, \\\"char\\\": 3, \\\"'x'\\\": 4, \\\"digit\\\": 18, \\\"111\\\": 19, \\\"\\\\\\\"t\\\\\\\"\\\": 2, \\\"2019-11-10\\\": 1, \\\"17:11:42(JST)\\\": 1, \\\"ascii_lowercase,\\\": 1, \\\"ascii_uppercase,\\\": 1, \\\"bi_l,\\\": 1, \\\"bi_r\\\": 1, \\\"op\\\": 1, \\\"scipy.misc\\\": 1, \\\"nstr\\\": 3, \\\"translate\\\": 8, \\\"maketrans\\\": 6, \\\"\\\\\\\"nine\\\\\\\"\\\": 2, \\\"add_stock\\\": 3, \\\"#111\\\": 1, \\\"\\\\\\\"*\\\\\\\"\\\": 4, \\\"\\\\\\\"Z\\\\\\\"\\\": 2, \\\"###############################################################################\\\": 2, \\\"binl\\\": 1, \\\"intin\\\": 2, \\\"input_tuple\\\": 4, \\\"intina\\\": 1, \\\"intinl\\\": 1, \\\"modadd\\\": 1, \\\"global\\\": 2, \\\"modmlt\\\": 1, \\\"get_divisors\\\": 1, \\\"retlist\\\": 4, \\\"make_linklist\\\": 1, \\\"xylist\\\": 2, \\\"linklist\\\": 12, \\\"setdefault\\\": 2, \\\"calc_longest_distance\\\": 3, \\\"distance_list\\\": 3, \\\"distance_count\\\": 3, \\\"distance\\\": 8, \\\"vlist_previous\\\": 3, \\\"vlist\\\": 11, \\\"nodecount\\\": 2, \\\"vlist_next\\\": 3, \\\"vlist_to_del\\\": 2, \\\"max_distance\\\": 4, \\\"items\\\": 1, \\\"calc_tree_diameter\\\": 1, \\\"\\\\\\\"x\\\\\\\"\\\": 8, \\\"ABC\\\": 1, \\\"111:\\\": 1, \\\"\\\\u2013\\\": 1, \\\"999\\\": 7, \\\"'*'\\\": 2, \\\"num1\\\": 9, \\\"num2\\\": 7, \\\"num2_sam\\\": 6, \\\"counts\\\": 6, \\\"most_common\\\": 4, \\\"#ABC111\\\": 1, \\\"INTM\\\": 1, \\\"STRM\\\": 1, \\\"LISTS\\\": 1, \\\"do\\\": 2, \\\"#print(n[i])\\\": 1, \\\"'5'\\\": 2, \\\"900\\\": 1, \\\"90\\\": 1, \\\"f_num\\\": 7, \\\"correct\\\": 5, \\\"dst\\\": 2, \\\"mojiretu\\\": 2, \\\"','\\\": 1, \\\"input()\\\": 1, \\\"list(map(int,\\\": 2, \\\"list(input())))\\\": 1, \\\"\\\\u30b9\\\\u30da\\\\u30fc\\\\u30b9\\\\u304c\\\\u306a\\\\u3044\\\\u6570\\\\u5b57\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u8aad\\\\u307f\\\\u8fbc\\\\u307f\\\": 1, \\\"\\\\u512a\\\\u5148\\\\u5ea6\\\\u4ed8\\\\u304d\\\\u30ad\\\\u30e5\\\\u30fc(\\\\u6700\\\\u5c0f\\\\u5024\\\\u53d6\\\\u308a\\\\u51fa\\\\u3057)\\\": 1, \\\"sr\\\": 3, \\\"ir\\\": 2, \\\"lr\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"n\\\\u3092\\\\u7d20\\\\u56e0\\\\u6570\\\\u5206\\\\u89e3\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"\\\\\\\"\\\\\\\"\\\\\\\"2\\\\u4ee5\\\\u4e0a\\\\u306e\\\\u6574\\\\u6570n\\\": 1, \\\"=>\\\": 1, \\\"[[\\\\u7d20\\\\u56e0\\\\u6570,\\\": 1, \\\"\\\\u6307\\\\u6570],\\\": 1, \\\"...]\\\\u306e2\\\\u6b21\\\\u5143\\\\u30ea\\\\u30b9\\\\u30c8\\\\\\\"\\\\\\\"\\\\\\\"\\\": 1, \\\"factorization\\\": 1, \\\"a^n\\\": 1, \\\"power\\\": 1, \\\"n*(n-1)*...*(l+1)*l\\\": 1, \\\"kaijo\\\": 1, \\\"Union\\\": 1, \\\"Find\\\": 1, \\\"UnionFind\\\": 1, \\\"parents\\\": 12, \\\"union\\\": 1, \\\"members\\\": 3, \\\"root\\\": 2, \\\"roots\\\": 4, \\\"group_count\\\": 1, \\\"all_group_members\\\": 1, \\\"__str__\\\": 2, \\\"'{}:\\\": 1, \\\"\\\\u7d04\\\\u6570\\\\u751f\\\\u6210\\\": 1, \\\"make_divisors\\\": 1, \\\"divisors\\\": 5, \\\"\\\\\\\"4\\\\\\\"\\\": 2, \\\"'2'\\\": 6, \\\"'91'\\\": 1, \\\"800\\\": 2, \\\"80\\\": 2, \\\"new_n\\\": 4, \\\"N_str\\\": 7, \\\"N_new\\\": 2, \\\"'a'\\\": 4, \\\"#111a\\\": 1, \\\"'.'\\\": 2, \\\"inums\\\": 2, \\\"[int(i)for\\\": 1, \\\"'Q'\\\": 2, \\\"output\\\": 8, \\\"n_list\\\": 7, \\\"#vin=[int(i)\\\": 1, \\\"v]\\\": 1, \\\"nlis\\\": 1, \\\"nint\\\": 2, \\\"part_num\\\": 6, \\\"ev_num\\\": 4, \\\"ev\\\": 2, \\\"count_ev\\\": 3, \\\"ans_ev\\\": 2, \\\"od_num\\\": 4, \\\"od\\\": 2, \\\"count_od\\\": 3, \\\"ans_od\\\": 2, \\\"v_int\\\": 3, \\\"v_odd\\\": 3, \\\"v_even\\\": 3, \\\"c_odd\\\": 6, \\\"c_even\\\": 6, \\\"max_odd\\\": 12, \\\"second_odd\\\": 8, \\\"max_key_odd\\\": 3, \\\"max_even\\\": 12, \\\"second_even\\\": 8, \\\"max_key_even\\\": 3, \\\"sc\\\": 9, \\\"replace1and9\\\": 2, \\\"n3\\\": 3, \\\"m3\\\": 3, \\\"head\\\": 2, \\\"foll\\\": 2, \\\"cf\\\": 4, \\\"h_\\\": 9, 