"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 10000, \"filters\": \"\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": \"<UNK>\", \"document_count\": 138987, \"word_counts\": \"{\\\"s\\\": 1299, \\\"=\\\": 9746, \\\"[\\\": 2443, \\\"]\\\": 2443, \\\"\\\\n\\\": 15645, \\\"a\\\": 2465, \\\"int\\\": 1683, \\\"(\\\": 12350, \\\"input\\\": 2055, \\\")\\\": 12346, \\\"if\\\": 1506, \\\"0\\\": 2238, \\\":\\\": 4840, \\\".\\\": 3315, \\\"append\\\": 360, \\\"elif\\\": 343, \\\"1\\\": 3004, \\\"else\\\": 768, \\\"len\\\": 429, \\\">\\\": 309, \\\"pop\\\": 100, \\\"for\\\": 1222, \\\"l\\\": 413, \\\"in\\\": 1259, \\\"print\\\": 2160, \\\"list\\\": 581, \\\"map\\\": 679, \\\"str\\\": 388, \\\",\\\": 3835, \\\"split\\\": 880, \\\"ans\\\": 1011, \\\"i\\\": 2213, \\\"\\\\\\\"\\\": 2448, \\\"b\\\": 1183, \\\"del\\\": 30, \\\"-\\\": 1206, \\\"join\\\": 210, \\\"range\\\": 720, \\\"'\\\": 1585, \\\"'b'\\\": 105, \\\"!\\\": 275, \\\"remove\\\": 18, \\\"''\\\": 210, \\\"is\\\": 28, \\\"+\\\": 923, \\\"and\\\": 358, \\\"while\\\": 267, \\\"#\\\": 678, \\\"b\\\\u304c\\\\u5b58\\\\u5728\\\\u3059\\\\u308b\\\\u9593\\\\u5b9f\\\\u884c\\\": 1, \\\"index\\\": 54, \\\"\\\\u6700\\\\u521d\\\\u306eb\\\\u306e\\\\u30a4\\\\u30f3\\\\u30c7\\\\u30c3\\\\u30af\\\\u30b9\\\\u3092\\\\u53d6\\\\u5f97\\\": 1, \\\"b\\\\u304c\\\\u5148\\\\u982d\\\\u3067\\\\u306a\\\\u3044\\\\u3068\\\\u304d\\\": 1, \\\"b\\\\u306e\\\": 1, \\\"\\\\u500b\\\\u524d\\\\u3068b\\\\u3092\\\\u6d88\\\\u3059\\\": 1, \\\"b\\\\u304c\\\\u5148\\\\u982d\\\\u306e\\\\u6642\\\": 1, \\\"\\\\u3053\\\\u306e\\\\u533a\\\\u5207\\\\u308a\\\\u6587\\\\u5b57\\\\u3067\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u9023\\\\u7d50\\\": 1, \\\"*\\\": 1962, \\\"q\\\": 28, \\\"chr\\\": 3, \\\"x\\\": 2298, \\\"8\\\": 178, \\\"sep\\\": 19, \\\"result\\\": 83, \\\"raw\\\": 129, \\\"_\\\": 2509, \\\"out\\\": 38, \\\"import\\\": 546, \\\"sys\\\": 320, \\\"stdin\\\": 173, \\\"ni\\\": 3, \\\"lambda\\\": 59, \\\"ns\\\": 19, \\\"na\\\": 10, \\\"readline\\\": 97, \\\"or\\\": 145, \\\"sentence\\\": 7, \\\"continue\\\": 32, \\\"t\\\": 158, \\\"coding\\\": 74, \\\"utf\\\": 77, \\\"\\\\u6587\\\\u5b57\\\\u5217\\\\u306e\\\\u5165\\\\u529b\\\": 2, \\\"\\\\t\\\": 549, \\\"from\\\": 145, \\\"collections\\\": 44, \\\"deque\\\": 31, \\\"d\\\": 169, \\\"&\\\": 17, \\\"n\\\": 1731, \\\"c\\\": 306, \\\"ln\\\": 6, \\\"\\\\u7b54\\\\u3048\\\\u7528\\\\u610f\\\": 1, \\\"\\\\u672b\\\\u5c3e\\\\u306b\\\\u8981\\\\u7d20\\\\u8ffd\\\\u52a0\\\": 1, \\\"\\\\u9577\\\\u3055\\\": 1, \\\"\\\\u6307\\\\u5b9a\\\\u3057\\\\u305f\\\\u4f4d\\\\u7f6e\\\": 1, \\\"\\\\u4eca\\\\u56de\\\\u306f\\\\u672b\\\\u5c3e\\\": 1, \\\"\\\\u306e\\\\u8981\\\\u7d20\\\\u3092\\\\u524a\\\\u9664\\\": 1, \\\"p\\\": 81, \\\"<\\\": 254, \\\"arr\\\": 24, \\\"new\\\": 44, \\\"def\\\": 361, \\\"typing\\\": 2, \\\"re\\\": 15, \\\"text\\\": 26, \\\"length\\\": 33, \\\"sub\\\": 11, \\\"|\\\": 5, \\\"?\\\": 155, \\\"b'\\\": 10, \\\"try\\\": 84, \\\"except\\\": 86, \\\"indexerror\\\": 2, \\\"li\\\": 60, \\\"sz\\\": 4, \\\"end\\\": 105, \\\"ss\\\": 19, \\\"flg\\\": 13, \\\"reverse\\\": 137, \\\"r\\\": 860, \\\"e\\\": 22, \\\"orders\\\": 2, \\\"display\\\": 15, \\\"order\\\": 4, \\\"pass\\\": 23, \\\"setrecursionlimit\\\": 14, \\\"9\\\": 596, \\\"inf\\\": 13, \\\"mod\\\": 57, \\\"7\\\": 67, \\\"rstrip\\\": 40, \\\"yesno\\\": 2, \\\"bool\\\": 7, \\\"'yes'\\\": 4, \\\"'no'\\\": 4, \\\"main\\\": 214, \\\"name\\\": 82, \\\"math\\\": 504, \\\"defaultdict\\\": 10, \\\"itertools\\\": 19, \\\"copy\\\": 68, \\\"deepcopy\\\": 13, \\\"random\\\": 2, \\\"heapq\\\": 14, \\\"heappop\\\": 8, \\\"heappush\\\": 6, \\\"time\\\": 10, \\\"os\\\": 6, \\\"queue\\\": 6, \\\"datetime\\\": 1, \\\"functools\\\": 11, \\\"lru\\\": 7, \\\"cache\\\": 7, \\\"@\\\": 6, \\\"maxsize\\\": 2, \\\"none\\\": 14, \\\"2\\\": 1587, \\\"numpy\\\": 12, \\\"as\\\": 31, \\\"np\\\": 36, \\\"alphabet\\\": 1, \\\"abcdefghijklmnopqrstuvwxyz\\\": 1, \\\"yn\\\": 4, \\\"yes\\\": 11, \\\"no\\\": 11, \\\"class\\\": 23, \\\"union\\\": 3, \\\"find\\\": 18, \\\"init\\\": 5, \\\"self\\\": 135, \\\"rank\\\": 6, \\\"return\\\": 351, \\\"same\\\": 2, \\\"y\\\": 1904, \\\"link\\\": 2, \\\"unite\\\": 1, \\\"size\\\": 12, \\\"set\\\": 32, \\\"add\\\": 12, \\\"power\\\": 2, \\\"a\\\\u306fb\\\\u306e\\\\u7d2f\\\\u4e57\\\\u6570\\\\u304b\\\": 1, \\\"now\\\": 4, \\\"true\\\": 158, \\\"false\\\": 32, \\\"bin\\\": 25, \\\"num\\\": 215, \\\"get\\\": 10, \\\"facs\\\": 1, \\\"%\\\": 565, \\\"comb\\\": 3, \\\"fac\\\": 4, \\\"pow\\\": 9, \\\"next\\\": 8, \\\"z\\\": 68, \\\"~\\\": 1, \\\"/\\\": 872, \\\"primes\\\": 1, \\\"type\\\": 16, \\\"prime\\\": 1, \\\"ifelse\\\": 1, \\\"factorize\\\": 1, \\\"dict\\\": 4, \\\"dic\\\": 12, \\\"{\\\": 299, \\\"}\\\": 299, \\\"floor\\\": 11, \\\"ceil\\\": 11, \\\"hani\\\": 1, \\\"min\\\": 226, \\\"max\\\": 702, \\\"ret\\\": 34, \\\"seifu\\\": 1, \\\"abs\\\": 20, \\\"cin\\\": 6, \\\"cino\\\": 2, \\\"test\\\": 12, \\\"not\\\": 33, \\\"cina\\\": 1, \\\"f\\\": 292, \\\"ch\\\": 7, \\\"k\\\": 111, \\\"m\\\": 275, \\\"string\\\": 40, \\\"counter\\\": 25, \\\"bisect\\\": 25, \\\"inp\\\": 18, \\\"inpl\\\": 5, \\\"inpln\\\": 1, \\\"popleft\\\": 6, \\\"stack\\\": 14, \\\"replace\\\": 142, \\\"\\\\\\\\\\\": 32, \\\"intl\\\": 2, \\\"lx\\\": 4, \\\"tuple\\\": 14, \\\"moji\\\": 12, \\\"word\\\": 26, \\\"data\\\": 69, \\\"buffer\\\": 6, \\\"float\\\": 224, \\\"'inf'\\\": 6, \\\"resolve\\\": 4, \\\"res\\\": 68, \\\"reduce\\\": 7, \\\"rr\\\": 2, \\\"rs\\\": 2, \\\"ri\\\": 5, \\\"rm\\\": 1, \\\"rl\\\": 4, \\\"si\\\": 3, \\\"j\\\": 128, \\\"key\\\": 37, \\\"usr\\\": 24, \\\"env\\\": 20, \\\"python\\\": 25, \\\"3\\\": 306, \\\"reslut\\\": 5, \\\"\\\\u5165\\\\u529b\\\": 2, \\\"\\\\u7a7a\\\\u306e\\\\u30ea\\\\u30b9\\\\u30c8\\\": 1, \\\"c\\\\u304c\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u76ee\\\\u304b\\\\u3089a\\\\u307e\\\\u3067\\\": 1, \\\"b\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070\\\\u30a2\\\\u30da\\\\u30f3\\\\u30c9\\\": 1, \\\"b\\\\u3067\\\\u3042\\\\u3063\\\\u3066\\\\u3055\\\\u3089\\\\u306b\\\\u30ea\\\\u30b9\\\\u30c8\\\\u304c\\\\u304b\\\\u3089\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070pop\\\": 1, \\\"list\\\\u3092\\\\u304f\\\\u3063\\\\u3064\\\\u3051\\\\u305f\\\\u6587\\\\u5b57\\\\u306b\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"solve\\\": 17, \\\"cha\\\": 2, \\\"plist\\\": 7, \\\"format\\\": 164, \\\"answer\\\": 33, \\\"honmono\\\": 2, \\\"keys\\\": 5, \\\"inputs\\\": 16, \\\"enter\\\": 1, \\\"cnt\\\": 29, \\\"5\\\": 302, \\\"w\\\": 1050, \\\"first\\\": 25, \\\"total\\\": 8, \\\"row\\\": 7, \\\"^\\\": 6, \\\"sqrt\\\": 8, \\\"hypot\\\": 3, \\\"factorial\\\": 6, \\\"pi\\\": 381, \\\"sin\\\": 3, \\\"cos\\\": 3, \\\"tan\\\": 1, \\\"asin\\\": 1, \\\"acos\\\": 1, \\\"atan\\\": 1, \\\"radians\\\": 3, \\\"degrees\\\": 1, \\\"log\\\": 53, \\\"accumulate\\\": 7, \\\"permutations\\\": 7, \\\"combinations\\\": 8, \\\"with\\\": 2, \\\"replacement\\\": 1, \\\"product\\\": 6, \\\"groupby\\\": 2, \\\"operator\\\": 7, \\\"itemgetter\\\": 8, \\\"mul\\\": 7, \\\"ascii\\\": 9, \\\"lowercase\\\": 5, \\\"uppercase\\\": 4, \\\"digits\\\": 7, \\\"left\\\": 9, \\\"fractions\\\": 15, \\\"gcd\\\": 271, \\\"strip\\\": 29, \\\"zip\\\": 2, \\\"exit\\\": 22, \\\"\\\\u30d0\\\\u30a4\\\\u30ca\\\\u30ea\\\\u30cf\\\\u30c3\\\\u30af\\\\u30a4\\\\u30fc\\\\u30b8\\\\u30fc\\\": 1, \\\"lst\\\": 70, \\\"lifoqueue\\\": 1, \\\"cmp\\\": 1, \\\"to\\\": 8, \\\"'yneos'\\\": 1, \\\"judge\\\": 2, \\\"lcm\\\": 7, \\\"intinput\\\": 2, \\\"mulinputs\\\": 1, \\\"lineinputs\\\": 1, \\\"func\\\": 5, \\\"datas\\\": 3, \\\"eoferror\\\": 44, \\\"break\\\": 124, \\\"modint\\\": 11, \\\"other\\\": 35, \\\"raise\\\": 8, \\\"exception\\\": 10, \\\"truediv\\\": 1, \\\"modinv\\\": 3, \\\"zerodivisionerror\\\": 1, \\\"s\\\\u306e\\\\u9006\\\\u6570\\\\u306f\\\\u6c42\\\\u307e\\\\u308a\\\\u307e\\\\u305b\\\\u3093\\\\u3002\\\": 1, \\\"u\\\": 27, \\\"v\\\": 89, \\\";\\\": 53, \\\"stk\\\": 6, \\\"empty\\\": 2, \\\"put\\\": 1, \\\"\\\\u51fa\\\\u529b\\\": 1, \\\"eof\\\": 1, \\\"\\\\u89e3\\\\u3051\\\\u305f\\\": 1, \\\"\\\\u5165\\\\u529b\\\\u306e\\\\u6587\\\\u5b57\\\\u5217\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u305a\\\\u3064\\\\u898b\\\\u3066\\\\u3086\\\\u304f\\\": 1, \\\"\\\\u3082\\\\u3057\\\": 1, \\\"\\\\u304b\\\": 1, \\\"\\\\u306e\\\\u5834\\\\u5408\\\\u3001\\\\u305d\\\\u308c\\\\u3092\\\\u8ffd\\\\u52a0\\\": 1, \\\"\\\\u3082\\\\u3057\\\\u30d0\\\\u30c3\\\\u30af\\\\u30b9\\\\u30da\\\\u30fc\\\\u30b9\\\\u306e\\\\u5834\\\\u5408\\\\u3001\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u524a\\\\u9664\\\": 1, \\\"enumerate\\\": 16, \\\"convert\\\": 2, \\\"initialization\\\": 1, \\\"of\\\": 6, \\\"traverse\\\": 1, \\\"the\\\": 2, \\\"nl\\\": 15, \\\"sl\\\": 1, \\\"created\\\": 2, \\\"on\\\": 10, \\\"thu\\\": 1, \\\"jun\\\": 3, \\\"4\\\": 140, \\\"author\\\": 3, \\\"sd\\\": 1, \\\"6\\\": 240, \\\"count\\\": 69, \\\"st\\\": 8, \\\"value\\\": 24, \\\"second\\\": 59, \\\"sort\\\": 58, \\\"mapint\\\": 2, \\\"stringlist\\\": 1, \\\"intlistlist\\\": 1, \\\"intcolslist\\\": 2, \\\"roundup\\\": 2, \\\"touppermultiple\\\": 1, \\\"tolowermultiple\\\": 1, \\\"nearpow\\\": 1, \\\"sorted\\\": 103, \\\"tmp\\\": 126, \\\"sa\\\": 8, \\\"firsta\\\": 4, \\\"seconda\\\": 3, \\\"cont\\\": 2, \\\"insert\\\": 12, \\\"duplicate\\\": 1, \\\"sec\\\": 11, \\\"idx\\\": 35, \\\"indexed\\\": 4, \\\"reversed\\\": 36, \\\"maxn\\\": 1, \\\"array\\\": 15, \\\"all\\\": 14, \\\"ind\\\": 13, \\\"argmax\\\": 4, \\\"ones\\\": 1, \\\"dtype\\\": 1, \\\"bk\\\": 3, \\\"cp\\\": 3, \\\"alist\\\": 21, \\\"nums\\\": 59, \\\"kou\\\": 4, \\\"val\\\": 32, \\\"seq\\\": 19, \\\"submit\\\": 2, \\\"read\\\": 6, \\\"inpur\\\": 1, \\\"lis\\\": 7, \\\"info\\\": 7, \\\"maxindex\\\": 9, \\\"lmax\\\": 4, \\\"rmax\\\": 4, \\\"aa\\\": 26, \\\"\\\\u6700\\\\u5927\\\\u5024\\\\u306eindex\\\\u3092\\\\u63a2\\\\u3057\\\\u3001\\\\u6700\\\\u5927\\\\u5024\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\\u78ba\\\\u8a8d\\\": 1, \\\"id\\\": 4, \\\"dash\\\": 2, \\\"pr\\\": 4, \\\"fi\\\": 3, \\\"se\\\": 2, \\\"heapify\\\": 4, \\\"lists\\\": 8, \\\"newlist\\\": 4, \\\"mx\\\": 4, \\\"itr\\\": 3, \\\"number\\\": 18, \\\"flag\\\": 50, \\\"maxim\\\": 4, \\\"two\\\": 8, \\\"forward\\\": 8, \\\"backward\\\": 8, \\\"maxi\\\": 1, \\\"nd\\\": 2, \\\"maxa\\\": 12, \\\"maxcnt\\\": 4, \\\"maxidx\\\": 4, \\\"seta\\\": 2, \\\"tempa\\\": 2, \\\"signal\\\": 1, \\\"nf\\\": 2, \\\"\\\\u5165\\\\u529b\\\\u5168\\\\u3066\\\": 1, \\\"eof\\\\u307e\\\\u3067\\\": 1, \\\"\\\\u3092\\\": 1, \\\"`\\\": 2, \\\"iter\\\": 1, \\\"\\\\u306b\\\\u5909\\\\u63db\\\": 1, \\\"open\\\": 3, \\\"al\\\": 10, \\\"ma\\\": 36, \\\"fst\\\": 8, \\\"snd\\\": 7, \\\"argfst\\\": 2, \\\"instas\\\": 3, \\\"one\\\": 2, \\\"ltor\\\": 6, \\\"rtol\\\": 7, \\\"pos\\\": 4, \\\"saidai\\\": 3, \\\"nibanme\\\": 2, \\\"amax\\\": 21, \\\"bs\\\": 5, \\\"seca\\\": 3, \\\"delete\\\": 3, \\\"rli\\\": 1, \\\"la\\\": 3, \\\"kk\\\": 4, \\\"filter\\\": 2, \\\"apple\\\": 9, \\\"big\\\": 18, \\\"orange\\\": 3, \\\"xx\\\": 4, \\\"hoge\\\": 12, \\\"huga\\\": 8, \\\"buff\\\": 12, \\\"sum\\\": 87, \\\"mm\\\": 2, \\\"ap\\\": 4, \\\"idxs\\\": 3, \\\"argsort\\\": 3, \\\"ac\\\": 4, \\\"ll\\\": 5, \\\"slove\\\": 4, \\\"n'\\\": 10, \\\"escape\\\": 2, \\\"compare\\\": 3, \\\"calc\\\": 11, \\\"anoa\\\": 4, \\\"tempmax\\\": 3, \\\"vmax\\\": 5, \\\"maxx\\\": 5, \\\"ruiseki\\\": 8, \\\"assert\\\": 1, \\\"rema\\\": 2, \\\"maxvalue\\\": 6, \\\"nextvalue\\\": 2, \\\"item\\\": 11, \\\"temp\\\": 48, \\\"numbers\\\": 15, \\\"nlist\\\": 3, \\\"anslist\\\": 4, \\\"fastinput\\\": 3, \\\"findex\\\": 1, \\\"ai\\\": 8, \\\"largest\\\": 2, \\\"'''\\\": 10, \\\"iiou\\\": 1, \\\"ii\\\": 4, \\\"nmax\\\": 15, \\\"arg\\\": 4, \\\"others\\\": 3, \\\"your\\\": 10, \\\"code\\\": 10, \\\"here\\\": 10, \\\"target\\\": 3, \\\"nlargest\\\": 1, \\\"h\\\": 1048, \\\"dou\\\": 3, \\\"sq\\\": 9, \\\"nearx\\\": 3, \\\"neary\\\": 3, \\\"'a'\\\": 5, \\\"area\\\": 117, \\\"\\\\u6a2a\\\\u306b\\\\u30e9\\\\u30a4\\\\u30f3\\\\u3092\\\\u5f15\\\\u304f\\\": 1, \\\"tatemax\\\": 8, \\\"yokomax\\\": 8, \\\"ansx\\\": 6, \\\"ansy\\\": 4, \\\"cent\\\": 12, \\\"abc\\\": 8, \\\"pirnt\\\": 1, \\\"double\\\": 9, \\\"mem\\\": 8, \\\"whxy\\\": 9, \\\"dup\\\": 4, \\\"pprint\\\": 3, \\\"lf\\\": 2, \\\"ls\\\": 10, \\\"mi\\\": 13, \\\"halfw\\\": 2, \\\"halfh\\\": 2, \\\"areas\\\": 5, \\\"cond\\\": 3, \\\"\\\\u3000or\\\": 1, \\\"decimal\\\": 5, \\\"center\\\": 8, \\\"width\\\": 3, \\\"height\\\": 2, \\\"menseki\\\": 25, \\\"ws\\\": 3, \\\"hs\\\": 5, \\\"rectangle\\\": 7, \\\"cutting\\\": 4, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u3092\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\\u305f\\\\u3081\\\\u306b\\\\u306f\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308b\\\\u5fc5\\\\u8981\\\\u304c\\\\u3042\\\\u308b\\\": 1, \\\"\\\\u305f\\\\u3060\\\\u3057\\\\u3001\\\\u6307\\\\u5b9a\\\\u3055\\\\u308c\\\\u305f\\\\u5ea7\\\\u6a19\\\\u304c\\\\u4e2d\\\\u5fc3\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u7121\\\\u9650\\\\u306b\\\\u76f4\\\\u7dda\\\\u304c\\\\u5f3e\\\\u3051\\\\u308b\\\": 1, \\\"makey\\\": 2, \\\"only\\\": 5, \\\"tate\\\": 19, \\\"yoko\\\": 17, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u5185\\\\u3067\\\\u3042\\\\u308c\\\\u3070\\\\u3001\\\\u4e2d\\\\u5fc3\\\\u304b\\\\u3089\\\\u306e\\\\u5bfe\\\\u8c61\\\\u70b9\\\\u3092\\\\u9078\\\\u3076\\\\u4e8b\\\\u306b\\\\u3088\\\\u308a\\\\u3001\\\": 1, \\\"\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u3001\\\": 1, \\\"\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\\u3002\\\\u305d\\\\u3046\\\\u3058\\\\u3083\\\\u306a\\\\u3044\\\\u3068\\\\u3060\\\\u3081\\\": 1, \\\"pat\\\": 11, \\\"quit\\\": 1, \\\"dx\\\": 15, \\\"dy\\\": 20, \\\"cog\\\": 12, \\\"\\\\u771f\\\\u3093\\\\u4e2d\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u5fc5\\\\u305a\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u3066\\\\u3053\\\\u308c\\\\u304c\\\\u6700\\\\u5927\\\\u5024\\\\u3060\\\\u304c\\\\u3001\\\\u81ea\\\\u5206\\\\u81ea\\\\u8eab\\\\u304c\\\\u771f\\\\u3093\\\\u4e2d\\\\u306e\\\\u5ea7\\\\u6a19\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u81ea\\\\u5206\\\\u81ea\\\\u4fe1\\\\u3092\\\\u901a\\\\u308b\\\\u3069\\\\u3093\\\\u306a\\\\u76f4\\\\u7dda\\\\u3082\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"multi\\\": 14, \\\"\\\\u5bfe\\\\u89d2\\\\u7dda\\\": 1, \\\"\\\\u70b9\\\": 1, \\\"bunkatsu\\\": 3, \\\"atcoder\\\": 4, \\\"beginner\\\": 3, \\\"contest\\\": 3, \\\"men\\\": 11, \\\"dif\\\": 3, \\\"\\\\u3067\\\\u3064oo\\\": 1, \\\"you\\\": 1, \\\"play\\\": 1, \\\"cards\\\": 1, \\\"you're\\\": 1, \\\"dealt\\\": 1, \\\"d'\\\": 3, \\\"check\\\": 18, \\\"nn\\\": 1, \\\"xeven\\\": 2, \\\"yeven\\\": 2, \\\"tue\\\": 1, \\\"may\\\": 1, \\\"shinba\\\": 1, \\\"horizon\\\": 3, \\\"vertical\\\": 3, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u5b58\\\\u5728\\\\u3059\\\\u308c\\\\u3070\\\\u4e09\\\\u89d2\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u306a\\\\u3044\\\\u6642\\\": 1, \\\"right\\\": 6, \\\"sqs\\\": 1, \\\"another\\\": 3, \\\"ignore\\\": 1, \\\"trailing\\\": 1, \\\"spaces\\\": 1, \\\"buf\\\": 6, \\\"ver\\\": 5, \\\"hori\\\": 4, \\\"square\\\": 2, \\\"sm\\\": 9, \\\"co\\\": 4, \\\"debug\\\": 2, \\\"dprint\\\": 1, \\\"args\\\": 3, \\\"kwargs\\\": 2, \\\"nr\\\": 3, \\\"point\\\": 3, \\\"candidate\\\": 6, \\\"way\\\": 3, \\\"cenx\\\": 2, \\\"ceny\\\": 2, \\\"readints\\\": 1, \\\"ncr\\\": 1, \\\"has\\\": 4, \\\"duplicates\\\": 1, \\\"seen\\\": 4, \\\"divisor\\\": 37, \\\"coordinates\\\": 1, \\\"harf\\\": 5, \\\"axis\\\": 2, \\\"any\\\": 1, \\\"case\\\": 3, \\\"lsq\\\": 2, \\\"rsq\\\": 2, \\\"wk\\\": 6, \\\"usq\\\": 2, \\\"dsq\\\": 2, \\\"equal\\\": 1, \\\"output\\\": 9, \\\"half\\\": 5, \\\"\\\\u518d\\\\u5e30\\\\u95a2\\\\u6570\\\\u306e\\\\u4e0a\\\\u9650\\\": 1, \\\"\\\\u4ee5\\\\u4e0a\\\\u306e\\\\u5834\\\\u5408python\\\": 1, \\\"dcp\\\": 1, \\\"\\\\u5206\\\\u63a2\\\\u7d22\\\": 1, \\\"a\\\\u306f\\\\u30bd\\\\u30fc\\\\u30c8\\\\u6e08\\\\u307f\\\\u3067\\\\u3042\\\\u308b\\\\u5fc5\\\\u8981\\\\u3042\\\\u308a\\\\u3002a\\\\u306e\\\\u4e2d\\\\u304b\\\\u3089x\\\\u672a\\\\u6e80\\\\u306e\\\\u8981\\\\u7d20\\\\u6570\\\\u3092\\\\u8fd4\\\\u3059\\\\u3002right\\\\u3060\\\\u3068\\\\u4ee5\\\\u4e0b\\\": 1, \\\"appendleft\\\": 1, \\\"rotate\\\": 1, \\\"\\\\u3067\\\": 1, \\\"\\\\u2192\\\": 1, \\\"\\\\u306bn\\\\u56de\\\\u30ed\\\\u30fc\\\\u30c6\\\\u30fc\\\\u30c8\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u5217\\\\u3092\\\\u500b\\\\u6570\\\\u30ab\\\\u30a6\\\\u30f3\\\\u30c8\\\\u8f9e\\\\u66f8\\\\u306b\\\\u3001\\\": 1, \\\"most\\\": 5, \\\"common\\\": 21, \\\"values\\\": 7, \\\"items\\\": 2, \\\"\\\\u7d2f\\\\u7a4d\\\\u548c\\\": 1, \\\"\\\\u3068\\\\u3057\\\\u306a\\\\u3044\\\\u3053\\\\u3068\\\\u3001\\\\u8fd4\\\\u308a\\\\u5024\\\\u306fnone\\\": 1, \\\"\\\\u53e4\\\\u3044atcoder\\\\u30b3\\\\u30f3\\\\u30c6\\\\u30b9\\\\u30c8\\\\u306e\\\\u5834\\\\u5408gcd\\\\u306a\\\\u3069\\\\u306f\\\\u3053\\\\u3053\\\\u304b\\\\u3089import\\\\u3059\\\\u308b\\\": 1, \\\"pypy\\\\u3067\\\\u3082\\\\u3046\\\\u3054\\\\u304f\\\": 1, \\\"maxsize\\\\u306f\\\\u4fdd\\\\u5b58\\\\u3059\\\\u308b\\\\u30c7\\\\u30fc\\\\u30bf\\\\u6570\\\\u306e\\\\u6700\\\\u5927\\\\u5024\\\\u3001\\\": 1, \\\"n\\\\u304c\\\\u6700\\\\u3082\\\\u9ad8\\\\u52b9\\\\u7387\\\": 1, \\\"printe\\\": 1, \\\"file\\\": 1, \\\"stderr\\\": 1, \\\"printl\\\": 1, \\\"inds\\\": 4, \\\"alp\\\": 2, \\\"cap\\\": 4, \\\"ord\\\": 4, \\\"matmat\\\": 1, \\\"matvec\\\": 1, \\\"\\\\u4e8c\\\\u500b\\\\u76ee\\\\u306e\\\\u8981\\\\u7d20\\\\u3067\\\\u964d\\\\u9806\\\\u4e26\\\\u3073\\\\u66ff\\\\u3048\\\": 1, \\\"\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u884c\\\\u5217\\\": 1, \\\"full\\\": 9, \\\"hantei\\\": 3, \\\"ld\\\": 3, \\\"lu\\\": 3, \\\"rd\\\": 3, \\\"ru\\\": 3, \\\"mins\\\": 2, \\\"\\\\u554f\\\\u984c\\\\uff1ahttps\\\": 1, \\\"jp\\\": 2, \\\"contests\\\": 1, \\\"tasks\\\": 1, \\\"points\\\": 3, \\\"\\\\u4e09\\\\u89d2\\\\u5f62\\\": 2, \\\"\\\\u306e\\\\u9762\\\\u7a4d\\\": 2, \\\"wy\\\": 5, \\\"xh\\\": 5, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"extend\\\": 4, \\\"'w\\\\u306e\\\\u9762\\\\u7a4d'\\\": 1, \\\"'h\\\\u306e\\\\u9762\\\\u7a4d'\\\": 1, \\\"'w\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62'\\\": 1, \\\"'h\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62'\\\": 1, \\\"'w\\\": 1, \\\"h'\\\": 1, \\\"max\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\": 1, \\\"inside\\\": 1, \\\"\\\\u521d\\\\u9805s\\\": 1, \\\"\\\\u4ea4\\\\u5deed\\\\u306en\\\\u500b\\\\u306e\\\\u6570\\\\u5217\\\\u306e\\\\u548c\\\": 1, \\\"arithmetic\\\": 1, \\\"progression\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5c0f\\\\u516c\\\\u500d\\\\u6570\\\": 1, \\\"g\\\": 5, \\\"xyplus\\\": 1, \\\"\\\\u91cd\\\\u5fc3\\\\u306b\\\\u6765\\\\u308b\\\\u6642\\\\u306f\\\\u8907\\\\u6570\\\\u3001\\\\u7dda\\\\u4e0a\\\\u3068\\\\u5185\\\\u90e8\\\\u306f\\\": 1, \\\"\\\\u3053\\\": 1, \\\"sp\\\": 3, \\\"fraction\\\": 3, \\\"rectanglecutting\\\": 4, \\\"lines\\\": 7, \\\"sv\\\": 6, \\\"separate\\\": 2, \\\"straight\\\": 2, \\\"line\\\": 123, \\\"\\\\u306e\\\\u50be\\\\u304d\\\": 2, \\\"\\\\u7dda\\\\u4e0a\\\\u306b\\\\u3042\\\\u308b\\\\u6642\\\": 1, \\\"\\\\u7b49\\\\u5206\\\\u53ef\\\\u80fd\\\": 1, \\\"\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\": 2, \\\"\\\\u7e26\\\\u6a2a\\\\u3067\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\": 1, \\\"\\\\u7e26\\\": 1, \\\"\\\\u6a2a\\\": 1, \\\"sh\\\": 4, \\\"dbg\\\": 4, \\\"kb\\\": 3, \\\"bytes\\\": 3, \\\"divide\\\": 41, \\\"ext\\\": 3, \\\"x\\\\u306e\\\\u65b9\\\\u304c\\\\u5927\\\\u304d\\\\u304f\\\\u306a\\\\u304f\\\\u3066\\\\u306f\\\\u306a\\\\u3089\\\\u306a\\\\u3044\\\": 1, \\\"future\\\": 1, \\\"function\\\": 1, \\\"io\\\": 1, \\\"start\\\": 1, \\\"clock\\\": 1, \\\"siki\\\": 2, \\\"include\\\": 3, \\\"stdio\\\": 1, \\\"void\\\": 2, \\\"scanf\\\": 2, \\\"printf\\\": 1, \\\"stdinput\\\": 2, \\\"xset\\\": 2, \\\"yset\\\": 4, \\\"matched\\\": 4, \\\"cd\\\": 6, \\\"intersection\\\": 4, \\\"small\\\": 9, \\\"herf\\\": 4, \\\"round\\\": 29, \\\"converter\\\": 6, \\\"larger\\\": 3, \\\"smaller\\\": 4, \\\"euclidean\\\": 3, \\\"gcm\\\": 4, \\\"getgcm\\\": 2, \\\"xy\\\": 15, \\\"greatest\\\": 12, \\\"divider\\\": 2, \\\"long\\\": 4, \\\"euclid\\\": 2, \\\"\\\\u8a08\\\\u7b97\\\\u91cf\\\\u554f\\\\u984c\\\\u3042\\\\u308a\\\": 1, \\\"lg\\\": 6, \\\"div\\\": 7, \\\"mygcd\\\": 3, \\\"version\\\": 1, \\\"minor\\\": 1, \\\"bb\\\": 8, \\\"\\\\u5c0f\\\\u6797\\\\u52c7\\\\u5e0c\\\": 1, \\\"mb\\\": 1, \\\"ex\\\": 2, \\\"getresult\\\": 2, \\\"gc\\\": 4, \\\"greatestdivisor\\\": 2, \\\"twoset\\\": 2, \\\"alds\\\": 1, \\\"java\\\": 1, \\\"util\\\": 1, \\\"scanner\\\": 7, \\\"public\\\": 3, \\\"static\\\": 2, \\\"system\\\": 2, \\\"nextint\\\": 2, \\\"close\\\": 1, \\\"println\\\": 1, \\\"helper\\\": 3, \\\"zzz\\\": 16, \\\"maximum\\\": 4, \\\"\\\\u306fswap\\\": 1, \\\"\\\\u5024\\\\u306e\\\\u4ea4\\\\u63db\\\": 1, \\\"\\\\u3092\\\\u8868\\\\u3059\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\\u306b\\\\u3088\\\\u308a\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"greatestcommondivisor\\\\u3092\\\\u6c42\\\\u3081\\\\u308b\\\": 1, \\\"\\\\u4ee5\\\\u4e0b\\\\u306e\\\\u3088\\\\u3046\\\\u306a\\\\u30a2\\\\u30eb\\\\u30b4\\\\u30ea\\\\u30ba\\\\u30e0\\\\u306fn\\\\u56de\\\\u306e\\\\u5272\\\\u308a\\\\u7b97\\\\u3092\\\\u884c\\\\u3046\\\\u5fc5\\\\u8981\\\\u304c\\\\u3042\\\\u308b\\\\u305f\\\\u3081\\\\u3001\\\\u5927\\\\u304d\\\\u306a\\\\u6570\\\\u306b\\\\u5bfe\\\\u3057\\\\u3066\\\\u306f\\\\u6642\\\\u9593\\\\u5185\\\\u306b\\\\u51fa\\\\u529b\\\\u3092\\\\u5f97\\\\u308b\\\\u3053\\\\u3068\\\\u306f\\\\u3067\\\\u304d\\\\u306a\\\\u3044\\\": 1, \\\"downto\\\": 1, \\\"\\\\u3068\\\": 5, \\\"\\\\u304c\\\\u3068\\\\u3082\\\\u306b\\\": 1, \\\"\\\\u3067\\\\u5272\\\\u308a\\\\u5207\\\\u308c\\\\u308b\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\\u306b\\\\u3088\\\\u308b\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\\u306e\\\\u5224\\\\u5b9a\\\": 1, \\\"swap\\\": 3, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\": 1, \\\"bq\\\": 1, \\\"\\\\u4e00\\\\u884c\\\\u306b\\\\u8907\\\\u6570\\\\u5165\\\\u529b\\\": 1, \\\"\\\\u6a19\\\\u6e96\\\\u5165\\\\u529b\\\\u3092\\\\u884c\\\\u3046\\\": 1, \\\"printarrline\\\": 1, \\\"inputarrline\\\": 2, \\\"ar\\\": 3, \\\"natural\\\": 4, \\\"slist\\\": 4, \\\"euclideanalg\\\": 3, \\\"yy\\\": 6, \\\"todo\\\": 1, \\\"\\\\u6700\\\\u521d\\\\u306b\\\\u78ba\\\\u8a8d\\\\u306eswap\\\": 1, \\\"\\\\u6bce\\\\u56de\\\\u5165\\\\u308c\\\\u66ff\\\\u3048\\\\u308bawap\\\": 1, \\\"\\\\u00a8\\\": 4, \\\"\\\\u00a7\\\": 1, \\\"\\\\u00b0\\\": 1, \\\"xcd\\\": 2, \\\"x\\\\u306e\\\\u7d04\\\\u6570\\\": 1, \\\"ycd\\\": 2, \\\"y\\\\u306e\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\uff58\\\\u3068y\\\\u306e\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\uff58\\\\u3068y\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\uff12\\\\u3064\\\\u306e\\\\u6574\\\\u6570\\\": 1, \\\"\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\\u3001x\\\": 1, \\\"\\\\u00f7\\\": 2, \\\"\\\\u306e\\\\u4f59\\\\u308a\\\\u304c\\\\u3068\\\\u3082\\\\u306b\\\": 1, \\\"\\\\u3068\\\\u306a\\\\u308b\\\": 1, \\\"\\\\u306e\\\\u3046\\\\u3061\\\\u6700\\\\u5927\\\\u306e\\\\u3082\\\\u306e\\\\u3092\\\\u3001x\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\\uff08greatest\\\": 1, \\\"divisor\\\\uff09\\\\u3068\\\\u8a00\\\\u3044\\\\u307e\\\\u3059\\\\u3002\\\": 1, \\\"\\\\u4f8b\\\\u3048\\\\u3070\\\\u3001\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\u306f\\\": 1, \\\"\\\\u3068\\\\u306a\\\\u308a\\\\u307e\\\\u3059\\\\u3002\\\\u3053\\\\u308c\\\\u306f\\\\u3001\\\": 1, \\\"\\\\u306e\\\\u7d04\\\\u6570\\\": 2, \\\"\\\\u3001\\\": 1, \\\"\\\\u306e\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"\\\\u306e\\\\u6700\\\\u5927\\\\u5024\\\\u3068\\\\u306a\\\\u308a\\\\u307e\\\\u3059\\\\u3002\\\": 1, \\\"f'\\\": 36, \\\"shu\\\": 2, \\\"my\\\": 3, \\\"froat\\\": 1, \\\"nag\\\": 2, \\\"\\\\u5186\\\\u5468\\\\u7387\\\": 1, \\\"\\\\u6d6e\\\\u52d5\\\\u5c0f\\\\u6570\\\\u70b9\\\\u6570\\\\u3067\\\\u8aad\\\\u3080\\\": 1, \\\"cir\\\": 2, \\\"\\\\u00a2\\\": 2, \\\"pie\\\": 2, \\\"circumference\\\": 12, \\\"circle\\\": 34, \\\"circum\\\": 2, \\\"sen\\\": 4, \\\"warnings\\\": 1, \\\"urllib\\\": 1, \\\"radius\\\": 9, \\\"perimeter\\\": 2, \\\"\\\\u03c0\\\": 3, \\\"ensyu\\\": 2, \\\"en\\\": 3, \\\"py\\\": 4, \\\"\\\\u9762\\\\u7a4d\\\": 1, \\\"\\\\u5186\\\\u5468\\\": 1, \\\"mennseki\\\": 2, \\\"ennsyuu\\\": 2, \\\"squre\\\": 2, \\\"lf'\\\": 1, \\\"are\\\": 2, \\\"sprit\\\": 1, \\\"calculate\\\": 2, \\\"around\\\": 4, \\\"inport\\\": 1, \\\"pai\\\": 3, \\\"iostream\\\": 1, \\\"iomanip\\\": 1, \\\"using\\\": 1, \\\"namespace\\\": 1, \\\"std\\\": 1, \\\"const\\\": 1, \\\"cout\\\": 1, \\\"fixed\\\": 1, \\\"setprecision\\\": 1, \\\"endl\\\": 1, \\\"dev\\\": 1, \\\"null\\\": 1, \\\"stdout\\\": 9, \\\"write\\\": 9, \\\"itp\\\": 1, \\\"o\\\": 17, \\\"table\\\": 18, \\\"sute\\\": 1, \\\"\\\\u2018\\\": 2, \\\"iterable\\\": 1, \\\"numlist\\\": 3, \\\"cn\\\": 4, \\\"print'\\\": 1, \\\"elem\\\": 4, \\\"\\\\u304c\\\": 1, \\\"\\\\u3088\\\\u308a\\\\u5927\\\\u304d\\\\u3044\\\\u3068\\\\u304d\\\\u3001\\\\u3064\\\\u307e\\\\u308a\\\\u6700\\\\u521d\\\\u306e\\\\u8981\\\\u7d20\\\\u3067\\\\u306f\\\\u306a\\\\u3044\\\\u3068\\\\u304d\\\\u7a7a\\\\u767d\\\\u3092\\\\u51fa\\\\u529b\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u3092\\\\u51fa\\\\u529b\\\": 1, \\\"'format\\\": 1, \\\"reveres\\\": 1, \\\"an\\\": 5, \\\"\\\\u306f\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u5f15\\\\u6570\\\\u306b\\\\u5c55\\\\u958b\\\": 1, \\\"xrange\\\": 1, \\\"cording\\\": 1, \\\"date\\\": 3, \\\"rx\\\": 2, \\\"\\\\u6570\\\\u5217\\\\u306e\\\\u53cd\\\\u8ee2\\\": 1, \\\"iline\\\": 3, \\\"ilinei\\\": 4, \\\"it\\\": 3, \\\"gyaku\\\": 2, \\\"translate\\\": 8, \\\"maketrans\\\": 6, \\\"dst\\\": 2, \\\"sam\\\": 6, \\\"counts\\\": 6, \\\"\\\\u30b9\\\\u30da\\\\u30fc\\\\u30b9\\\\u304c\\\\u306a\\\\u3044\\\\u6570\\\\u5b57\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u8aad\\\\u307f\\\\u8fbc\\\\u307f\\\": 1, \\\"\\\\u512a\\\\u5148\\\\u5ea6\\\\u4ed8\\\\u304d\\\\u30ad\\\\u30e5\\\\u30fc\\\": 1, \\\"\\\\u6700\\\\u5c0f\\\\u5024\\\\u53d6\\\\u308a\\\\u51fa\\\\u3057\\\": 1, \\\"sr\\\": 3, \\\"ir\\\": 2, \\\"lr\\\": 1, \\\"n\\\\u3092\\\\u7d20\\\\u56e0\\\\u6570\\\\u5206\\\\u89e3\\\": 1, \\\"\\\\u4ee5\\\\u4e0a\\\\u306e\\\\u6574\\\\u6570n\\\": 1, \\\"\\\\u7d20\\\\u56e0\\\\u6570\\\": 1, \\\"\\\\u6307\\\\u6570\\\": 1, \\\"\\\\u306e\\\": 1, \\\"\\\\u6b21\\\\u5143\\\\u30ea\\\\u30b9\\\\u30c8\\\": 1, \\\"factorization\\\": 1, \\\"kaijo\\\": 1, \\\"unionfind\\\": 1, \\\"parents\\\": 12, \\\"members\\\": 4, \\\"root\\\": 2, \\\"roots\\\": 4, \\\"group\\\": 2, \\\"\\\\u7d04\\\\u6570\\\\u751f\\\\u6210\\\": 1, \\\"make\\\": 2, \\\"divisors\\\": 7, \\\"inums\\\": 2, \\\"digit\\\": 28, \\\"binl\\\": 1, \\\"intin\\\": 2, \\\"intina\\\": 1, \\\"intinl\\\": 1, \\\"modadd\\\": 1, \\\"global\\\": 2, \\\"modmlt\\\": 1, \\\"retlist\\\": 4, \\\"linklist\\\": 13, \\\"xylist\\\": 2, \\\"setdefault\\\": 2, \\\"longest\\\": 3, \\\"distance\\\": 21, \\\"vlist\\\": 19, \\\"previous\\\": 3, \\\"nodecount\\\": 2, \\\"tree\\\": 1, \\\"diameter\\\": 1, \\\"'if\\\": 1, \\\"'else\\\": 1, \\\"'for\\\": 1, \\\"odd\\\": 32, \\\"even\\\": 32, \\\"'x'\\\": 8, \\\"repl\\\": 2, \\\"char\\\": 3, \\\"'o'\\\": 2, \\\"jst\\\": 1, \\\"bi\\\": 2, \\\"op\\\": 1, \\\"scipy\\\": 1, \\\"misc\\\": 1, \\\"stock\\\": 3, \\\"sc\\\": 9, \\\"mojiretu\\\": 2, \\\"rev\\\": 2, \\\"nine\\\": 2, \\\"'q'\\\": 2, \\\"nstr\\\": 3, \\\"\\\\u2013\\\": 1, \\\"intm\\\": 1, \\\"strm\\\": 1, \\\"do\\\": 2, \\\"head\\\": 2, \\\"foll\\\": 2, \\\"cf\\\": 4, \\\"inpsum\\\": 4, \\\"ij\\\": 3, \\\"seeds\\\": 3, \\\"'r'\\\": 1, \\\"'l'\\\": 1, \\\"'u'\\\": 1, \\\"'d'\\\": 1, \\\"vin\\\": 1, \\\"nlis\\\": 1, \\\"nint\\\": 2, \\\"part\\\": 6, \\\"ev\\\": 11, \\\"od\\\": 11, \\\"correct\\\": 5, \\\"excpet\\\": 1, \\\"digitnumber\\\": 2, \\\"eval\\\": 2, \\\"readlines\\\": 11, \\\"valueerror\\\": 3, \\\"condig\\\": 1, \\\"inl\\\": 8, \\\"fileinput\\\": 6, \\\"srt\\\": 1, \\\"ds\\\": 3, \\\"po\\\": 2, \\\"countlist\\\": 3, \\\"sumnum\\\": 5, \\\"inputnum\\\": 3, \\\"dn\\\": 6, \\\"splited\\\": 3, \\\"remaining\\\": 3, \\\"questions\\\": 3, \\\"plus\\\": 4, \\\"up\\\": 6, \\\"whlie\\\": 1, \\\"innums\\\": 11, \\\"\\\\u3000for\\\": 1, \\\"xp\\\": 2, \\\"yp\\\": 2, \\\"strs\\\": 2, \\\"jk\\\": 2, \\\"volume\\\": 1, \\\"http\\\": 1, \\\"aizu\\\": 1, \\\"onlinejudge\\\": 1, \\\"description\\\": 1, \\\"jsp\\\": 1, \\\"numl\\\": 3, \\\"digitstr\\\": 2, \\\"absum\\\": 4, \\\"reslt\\\": 1, \\\"tokens\\\": 3, \\\"wa\\\": 2, \\\"keta\\\": 2, \\\"numplusnum\\\": 2, \\\"returnlist\\\": 3, \\\"aoj\\\": 1, \\\"bal\\\": 1}\", \"word_docs\": \"{\\\"s\\\": 1299, \\\"=\\\": 9746, \\\"[\\\": 2443, \\\"]\\\": 2443, \\\"\\\\n\\\": 15645, \\\"a\\\": 2465, \\\"int\\\": 1683, \\\"(\\\": 12350, \\\"input\\\": 2055, \\\")\\\": 12346, \\\"if\\\": 1506, \\\"0\\\": 2238, \\\":\\\": 4840, \\\".\\\": 3315, \\\"append\\\": 360, \\\"elif\\\": 343, \\\"1\\\": 3004, \\\"else\\\": 768, \\\"len\\\": 429, \\\">\\\": 309, \\\"pop\\\": 100, \\\"for\\\": 1222, \\\"l\\\": 413, \\\"in\\\": 1259, \\\"print\\\": 2160, \\\"list\\\": 581, \\\"map\\\": 679, \\\"str\\\": 388, \\\",\\\": 3835, \\\"split\\\": 880, \\\"ans\\\": 1011, \\\"i\\\": 2213, \\\"\\\\\\\"\\\": 2448, \\\"b\\\": 1183, \\\"del\\\": 30, \\\"-\\\": 1206, \\\"join\\\": 210, \\\"range\\\": 720, \\\"'\\\": 1585, \\\"'b'\\\": 105, \\\"!\\\": 275, \\\"remove\\\": 18, \\\"''\\\": 210, \\\"is\\\": 28, \\\"+\\\": 923, \\\"and\\\": 358, \\\"while\\\": 267, \\\"#\\\": 678, \\\"b\\\\u304c\\\\u5b58\\\\u5728\\\\u3059\\\\u308b\\\\u9593\\\\u5b9f\\\\u884c\\\": 1, \\\"index\\\": 54, \\\"\\\\u6700\\\\u521d\\\\u306eb\\\\u306e\\\\u30a4\\\\u30f3\\\\u30c7\\\\u30c3\\\\u30af\\\\u30b9\\\\u3092\\\\u53d6\\\\u5f97\\\": 1, \\\"b\\\\u304c\\\\u5148\\\\u982d\\\\u3067\\\\u306a\\\\u3044\\\\u3068\\\\u304d\\\": 1, \\\"b\\\\u306e\\\": 1, \\\"\\\\u500b\\\\u524d\\\\u3068b\\\\u3092\\\\u6d88\\\\u3059\\\": 1, \\\"b\\\\u304c\\\\u5148\\\\u982d\\\\u306e\\\\u6642\\\": 1, \\\"\\\\u3053\\\\u306e\\\\u533a\\\\u5207\\\\u308a\\\\u6587\\\\u5b57\\\\u3067\\\\u30ea\\\\u30b9\\\\u30c8\\\\u3092\\\\u9023\\\\u7d50\\\": 1, \\\"*\\\": 1962, \\\"q\\\": 28, \\\"chr\\\": 3, \\\"x\\\": 2298, \\\"8\\\": 178, \\\"sep\\\": 19, \\\"result\\\": 83, \\\"raw\\\": 129, \\\"_\\\": 2509, \\\"out\\\": 38, \\\"import\\\": 546, \\\"sys\\\": 320, \\\"stdin\\\": 173, \\\"ni\\\": 3, \\\"lambda\\\": 59, \\\"ns\\\": 19, \\\"na\\\": 10, \\\"readline\\\": 97, \\\"or\\\": 145, \\\"sentence\\\": 7, \\\"continue\\\": 32, \\\"t\\\": 158, \\\"coding\\\": 74, \\\"utf\\\": 77, \\\"\\\\u6587\\\\u5b57\\\\u5217\\\\u306e\\\\u5165\\\\u529b\\\": 2, \\\"\\\\t\\\": 549, \\\"from\\\": 145, \\\"collections\\\": 44, \\\"deque\\\": 31, \\\"d\\\": 169, \\\"&\\\": 17, \\\"n\\\": 1731, \\\"c\\\": 306, \\\"ln\\\": 6, \\\"\\\\u7b54\\\\u3048\\\\u7528\\\\u610f\\\": 1, \\\"\\\\u672b\\\\u5c3e\\\\u306b\\\\u8981\\\\u7d20\\\\u8ffd\\\\u52a0\\\": 1, \\\"\\\\u9577\\\\u3055\\\": 1, \\\"\\\\u6307\\\\u5b9a\\\\u3057\\\\u305f\\\\u4f4d\\\\u7f6e\\\": 1, \\\"\\\\u4eca\\\\u56de\\\\u306f\\\\u672b\\\\u5c3e\\\": 1, \\\"\\\\u306e\\\\u8981\\\\u7d20\\\\u3092\\\\u524a\\\\u9664\\\": 1, \\\"p\\\": 81, \\\"<\\\": 254, \\\"arr\\\": 24, \\\"new\\\": 44, \\\"def\\\": 361, \\\"typing\\\": 2, \\\"re\\\": 15, \\\"text\\\": 26, \\\"length\\\": 33, \\\"sub\\\": 11, \\\"|\\\": 5, \\\"?\\\": 155, \\\"b'\\\": 10, \\\"try\\\": 84, \\\"except\\\": 86, \\\"indexerror\\\": 2, \\\"li\\\": 60, \\\"sz\\\": 4, \\\"end\\\": 105, \\\"ss\\\": 19, \\\"flg\\\": 13, \\\"reverse\\\": 137, \\\"r\\\": 860, \\\"e\\\": 22, \\\"orders\\\": 2, \\\"display\\\": 15, \\\"order\\\": 4, \\\"pass\\\": 23, \\\"setrecursionlimit\\\": 14, \\\"9\\\": 596, \\\"inf\\\": 13, \\\"mod\\\": 57, \\\"7\\\": 67, \\\"rstrip\\\": 40, \\\"yesno\\\": 2, \\\"bool\\\": 7, \\\"'yes'\\\": 4, \\\"'no'\\\": 4, \\\"main\\\": 214, \\\"name\\\": 82, \\\"math\\\": 504, \\\"defaultdict\\\": 10, \\\"itertools\\\": 19, \\\"copy\\\": 68, \\\"deepcopy\\\": 13, \\\"random\\\": 2, \\\"heapq\\\": 14, \\\"heappop\\\": 8, \\\"heappush\\\": 6, \\\"time\\\": 10, \\\"os\\\": 6, \\\"queue\\\": 6, \\\"datetime\\\": 1, \\\"functools\\\": 11, \\\"lru\\\": 7, \\\"cache\\\": 7, \\\"@\\\": 6, \\\"maxsize\\\": 2, \\\"none\\\": 14, \\\"2\\\": 1587, \\\"numpy\\\": 12, \\\"as\\\": 31, \\\"np\\\": 36, \\\"alphabet\\\": 1, \\\"abcdefghijklmnopqrstuvwxyz\\\": 1, \\\"yn\\\": 4, \\\"yes\\\": 11, \\\"no\\\": 11, \\\"class\\\": 23, \\\"union\\\": 3, \\\"find\\\": 18, \\\"init\\\": 5, \\\"self\\\": 135, \\\"rank\\\": 6, \\\"return\\\": 351, \\\"same\\\": 2, \\\"y\\\": 1904, \\\"link\\\": 2, \\\"unite\\\": 1, \\\"size\\\": 12, \\\"set\\\": 32, \\\"add\\\": 12, \\\"power\\\": 2, \\\"a\\\\u306fb\\\\u306e\\\\u7d2f\\\\u4e57\\\\u6570\\\\u304b\\\": 1, \\\"now\\\": 4, \\\"true\\\": 158, \\\"false\\\": 32, \\\"bin\\\": 25, \\\"num\\\": 215, \\\"get\\\": 10, \\\"facs\\\": 1, \\\"%\\\": 565, \\\"comb\\\": 3, \\\"fac\\\": 4, \\\"pow\\\": 9, \\\"next\\\": 8, \\\"z\\\": 68, \\\"~\\\": 1, \\\"/\\\": 872, \\\"primes\\\": 1, \\\"type\\\": 16, \\\"prime\\\": 1, \\\"ifelse\\\": 1, \\\"factorize\\\": 1, \\\"dict\\\": 4, \\\"dic\\\": 12, \\\"{\\\": 299, \\\"}\\\": 299, \\\"floor\\\": 11, \\\"ceil\\\": 11, \\\"hani\\\": 1, \\\"min\\\": 226, \\\"max\\\": 702, \\\"ret\\\": 34, \\\"seifu\\\": 1, \\\"abs\\\": 20, \\\"cin\\\": 6, \\\"cino\\\": 2, \\\"test\\\": 12, \\\"not\\\": 33, \\\"cina\\\": 1, \\\"f\\\": 292, \\\"ch\\\": 7, \\\"k\\\": 111, \\\"m\\\": 275, \\\"string\\\": 40, \\\"counter\\\": 25, \\\"bisect\\\": 25, \\\"inp\\\": 18, \\\"inpl\\\": 5, \\\"inpln\\\": 1, \\\"popleft\\\": 6, \\\"stack\\\": 14, \\\"replace\\\": 142, \\\"\\\\\\\\\\\": 32, \\\"intl\\\": 2, \\\"lx\\\": 4, \\\"tuple\\\": 14, \\\"moji\\\": 12, \\\"word\\\": 26, \\\"data\\\": 69, \\\"buffer\\\": 6, \\\"float\\\": 224, \\\"'inf'\\\": 6, \\\"resolve\\\": 4, \\\"res\\\": 68, \\\"reduce\\\": 7, \\\"rr\\\": 2, \\\"rs\\\": 2, \\\"ri\\\": 5, \\\"rm\\\": 1, \\\"rl\\\": 4, \\\"si\\\": 3, \\\"j\\\": 128, \\\"key\\\": 37, \\\"usr\\\": 24, \\\"env\\\": 20, \\\"python\\\": 25, \\\"3\\\": 306, \\\"reslut\\\": 5, \\\"\\\\u5165\\\\u529b\\\": 2, \\\"\\\\u7a7a\\\\u306e\\\\u30ea\\\\u30b9\\\\u30c8\\\": 1, \\\"c\\\\u304c\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u76ee\\\\u304b\\\\u3089a\\\\u307e\\\\u3067\\\": 1, \\\"b\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070\\\\u30a2\\\\u30da\\\\u30f3\\\\u30c9\\\": 1, \\\"b\\\\u3067\\\\u3042\\\\u3063\\\\u3066\\\\u3055\\\\u3089\\\\u306b\\\\u30ea\\\\u30b9\\\\u30c8\\\\u304c\\\\u304b\\\\u3089\\\\u3067\\\\u306a\\\\u3051\\\\u308c\\\\u3070pop\\\": 1, \\\"list\\\\u3092\\\\u304f\\\\u3063\\\\u3064\\\\u3051\\\\u305f\\\\u6587\\\\u5b57\\\\u306b\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"solve\\\": 17, \\\"cha\\\": 2, \\\"plist\\\": 7, \\\"format\\\": 164, \\\"answer\\\": 33, \\\"honmono\\\": 2, \\\"keys\\\": 5, \\\"inputs\\\": 16, \\\"enter\\\": 1, \\\"cnt\\\": 29, \\\"5\\\": 302, \\\"w\\\": 1050, \\\"first\\\": 25, \\\"total\\\": 8, \\\"row\\\": 7, \\\"^\\\": 6, \\\"sqrt\\\": 8, \\\"hypot\\\": 3, \\\"factorial\\\": 6, \\\"pi\\\": 381, \\\"sin\\\": 3, \\\"cos\\\": 3, \\\"tan\\\": 1, \\\"asin\\\": 1, \\\"acos\\\": 1, \\\"atan\\\": 1, \\\"radians\\\": 3, \\\"degrees\\\": 1, \\\"log\\\": 53, \\\"accumulate\\\": 7, \\\"permutations\\\": 7, \\\"combinations\\\": 8, \\\"with\\\": 2, \\\"replacement\\\": 1, \\\"product\\\": 6, \\\"groupby\\\": 2, \\\"operator\\\": 7, \\\"itemgetter\\\": 8, \\\"mul\\\": 7, \\\"ascii\\\": 9, \\\"lowercase\\\": 5, \\\"uppercase\\\": 4, \\\"digits\\\": 7, \\\"left\\\": 9, \\\"fractions\\\": 15, \\\"gcd\\\": 271, \\\"strip\\\": 29, \\\"zip\\\": 2, \\\"exit\\\": 22, \\\"\\\\u30d0\\\\u30a4\\\\u30ca\\\\u30ea\\\\u30cf\\\\u30c3\\\\u30af\\\\u30a4\\\\u30fc\\\\u30b8\\\\u30fc\\\": 1, \\\"lst\\\": 70, \\\"lifoqueue\\\": 1, \\\"cmp\\\": 1, \\\"to\\\": 8, \\\"'yneos'\\\": 1, \\\"judge\\\": 2, \\\"lcm\\\": 7, \\\"intinput\\\": 2, \\\"mulinputs\\\": 1, \\\"lineinputs\\\": 1, \\\"func\\\": 5, \\\"datas\\\": 3, \\\"eoferror\\\": 44, \\\"break\\\": 124, \\\"modint\\\": 11, \\\"other\\\": 35, \\\"raise\\\": 8, \\\"exception\\\": 10, \\\"truediv\\\": 1, \\\"modinv\\\": 3, \\\"zerodivisionerror\\\": 1, \\\"s\\\\u306e\\\\u9006\\\\u6570\\\\u306f\\\\u6c42\\\\u307e\\\\u308a\\\\u307e\\\\u305b\\\\u3093\\\\u3002\\\": 1, \\\"u\\\": 27, \\\"v\\\": 89, \\\";\\\": 53, \\\"stk\\\": 6, \\\"empty\\\": 2, \\\"put\\\": 1, \\\"\\\\u51fa\\\\u529b\\\": 1, \\\"eof\\\": 1, \\\"\\\\u89e3\\\\u3051\\\\u305f\\\": 1, \\\"\\\\u5165\\\\u529b\\\\u306e\\\\u6587\\\\u5b57\\\\u5217\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u305a\\\\u3064\\\\u898b\\\\u3066\\\\u3086\\\\u304f\\\": 1, \\\"\\\\u3082\\\\u3057\\\": 1, \\\"\\\\u304b\\\": 1, \\\"\\\\u306e\\\\u5834\\\\u5408\\\\u3001\\\\u305d\\\\u308c\\\\u3092\\\\u8ffd\\\\u52a0\\\": 1, \\\"\\\\u3082\\\\u3057\\\\u30d0\\\\u30c3\\\\u30af\\\\u30b9\\\\u30da\\\\u30fc\\\\u30b9\\\\u306e\\\\u5834\\\\u5408\\\\u3001\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u524a\\\\u9664\\\": 1, \\\"enumerate\\\": 16, \\\"convert\\\": 2, \\\"initialization\\\": 1, \\\"of\\\": 6, \\\"traverse\\\": 1, \\\"the\\\": 2, \\\"nl\\\": 15, \\\"sl\\\": 1, \\\"created\\\": 2, \\\"on\\\": 10, \\\"thu\\\": 1, \\\"jun\\\": 3, \\\"4\\\": 140, \\\"author\\\": 3, \\\"sd\\\": 1, \\\"6\\\": 240, \\\"count\\\": 69, \\\"st\\\": 8, \\\"value\\\": 24, \\\"second\\\": 59, \\\"sort\\\": 58, \\\"mapint\\\": 2, \\\"stringlist\\\": 1, \\\"intlistlist\\\": 1, \\\"intcolslist\\\": 2, \\\"roundup\\\": 2, \\\"touppermultiple\\\": 1, \\\"tolowermultiple\\\": 1, \\\"nearpow\\\": 1, \\\"sorted\\\": 103, \\\"tmp\\\": 126, \\\"sa\\\": 8, \\\"firsta\\\": 4, \\\"seconda\\\": 3, \\\"cont\\\": 2, \\\"insert\\\": 12, \\\"duplicate\\\": 1, \\\"sec\\\": 11, \\\"idx\\\": 35, \\\"indexed\\\": 4, \\\"reversed\\\": 36, \\\"maxn\\\": 1, \\\"array\\\": 15, \\\"all\\\": 14, \\\"ind\\\": 13, \\\"argmax\\\": 4, \\\"ones\\\": 1, \\\"dtype\\\": 1, \\\"bk\\\": 3, \\\"cp\\\": 3, \\\"alist\\\": 21, \\\"nums\\\": 59, \\\"kou\\\": 4, \\\"val\\\": 32, \\\"seq\\\": 19, \\\"submit\\\": 2, \\\"read\\\": 6, \\\"inpur\\\": 1, \\\"lis\\\": 7, \\\"info\\\": 7, \\\"maxindex\\\": 9, \\\"lmax\\\": 4, \\\"rmax\\\": 4, \\\"aa\\\": 26, \\\"\\\\u6700\\\\u5927\\\\u5024\\\\u306eindex\\\\u3092\\\\u63a2\\\\u3057\\\\u3001\\\\u6700\\\\u5927\\\\u5024\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\\u78ba\\\\u8a8d\\\": 1, \\\"id\\\": 4, \\\"dash\\\": 2, \\\"pr\\\": 4, \\\"fi\\\": 3, \\\"se\\\": 2, \\\"heapify\\\": 4, \\\"lists\\\": 8, \\\"newlist\\\": 4, \\\"mx\\\": 4, \\\"itr\\\": 3, \\\"number\\\": 18, \\\"flag\\\": 50, \\\"maxim\\\": 4, \\\"two\\\": 8, \\\"forward\\\": 8, \\\"backward\\\": 8, \\\"maxi\\\": 1, \\\"nd\\\": 2, \\\"maxa\\\": 12, \\\"maxcnt\\\": 4, \\\"maxidx\\\": 4, \\\"seta\\\": 2, \\\"tempa\\\": 2, \\\"signal\\\": 1, \\\"nf\\\": 2, \\\"\\\\u5165\\\\u529b\\\\u5168\\\\u3066\\\": 1, \\\"eof\\\\u307e\\\\u3067\\\": 1, \\\"\\\\u3092\\\": 1, \\\"`\\\": 2, \\\"iter\\\": 1, \\\"\\\\u306b\\\\u5909\\\\u63db\\\": 1, \\\"open\\\": 3, \\\"al\\\": 10, \\\"ma\\\": 36, \\\"fst\\\": 8, \\\"snd\\\": 7, \\\"argfst\\\": 2, \\\"instas\\\": 3, \\\"one\\\": 2, \\\"ltor\\\": 6, \\\"rtol\\\": 7, \\\"pos\\\": 4, \\\"saidai\\\": 3, \\\"nibanme\\\": 2, \\\"amax\\\": 21, \\\"bs\\\": 5, \\\"seca\\\": 3, \\\"delete\\\": 3, \\\"rli\\\": 1, \\\"la\\\": 3, \\\"kk\\\": 4, \\\"filter\\\": 2, \\\"apple\\\": 9, \\\"big\\\": 18, \\\"orange\\\": 3, \\\"xx\\\": 4, \\\"hoge\\\": 12, \\\"huga\\\": 8, \\\"buff\\\": 12, \\\"sum\\\": 87, \\\"mm\\\": 2, \\\"ap\\\": 4, \\\"idxs\\\": 3, \\\"argsort\\\": 3, \\\"ac\\\": 4, \\\"ll\\\": 5, \\\"slove\\\": 4, \\\"n'\\\": 10, \\\"escape\\\": 2, \\\"compare\\\": 3, \\\"calc\\\": 11, \\\"anoa\\\": 4, \\\"tempmax\\\": 3, \\\"vmax\\\": 5, \\\"maxx\\\": 5, \\\"ruiseki\\\": 8, \\\"assert\\\": 1, \\\"rema\\\": 2, \\\"maxvalue\\\": 6, \\\"nextvalue\\\": 2, \\\"item\\\": 11, \\\"temp\\\": 48, \\\"numbers\\\": 15, \\\"nlist\\\": 3, \\\"anslist\\\": 4, \\\"fastinput\\\": 3, \\\"findex\\\": 1, \\\"ai\\\": 8, \\\"largest\\\": 2, \\\"'''\\\": 10, \\\"iiou\\\": 1, \\\"ii\\\": 4, \\\"nmax\\\": 15, \\\"arg\\\": 4, \\\"others\\\": 3, \\\"your\\\": 10, \\\"code\\\": 10, \\\"here\\\": 10, \\\"target\\\": 3, \\\"nlargest\\\": 1, \\\"h\\\": 1048, \\\"dou\\\": 3, \\\"sq\\\": 9, \\\"nearx\\\": 3, \\\"neary\\\": 3, \\\"'a'\\\": 5, \\\"area\\\": 117, \\\"\\\\u6a2a\\\\u306b\\\\u30e9\\\\u30a4\\\\u30f3\\\\u3092\\\\u5f15\\\\u304f\\\": 1, \\\"tatemax\\\": 8, \\\"yokomax\\\": 8, \\\"ansx\\\": 6, \\\"ansy\\\": 4, \\\"cent\\\": 12, \\\"abc\\\": 8, \\\"pirnt\\\": 1, \\\"double\\\": 9, \\\"mem\\\": 8, \\\"whxy\\\": 9, \\\"dup\\\": 4, \\\"pprint\\\": 3, \\\"lf\\\": 2, \\\"ls\\\": 10, \\\"mi\\\": 13, \\\"halfw\\\": 2, \\\"halfh\\\": 2, \\\"areas\\\": 5, \\\"cond\\\": 3, \\\"\\\\u3000or\\\": 1, \\\"decimal\\\": 5, \\\"center\\\": 8, \\\"width\\\": 3, \\\"height\\\": 2, \\\"menseki\\\": 25, \\\"ws\\\": 3, \\\"hs\\\": 5, \\\"rectangle\\\": 7, \\\"cutting\\\": 4, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u3092\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\\u305f\\\\u3081\\\\u306b\\\\u306f\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308b\\\\u5fc5\\\\u8981\\\\u304c\\\\u3042\\\\u308b\\\": 1, \\\"\\\\u305f\\\\u3060\\\\u3057\\\\u3001\\\\u6307\\\\u5b9a\\\\u3055\\\\u308c\\\\u305f\\\\u5ea7\\\\u6a19\\\\u304c\\\\u4e2d\\\\u5fc3\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u7121\\\\u9650\\\\u306b\\\\u76f4\\\\u7dda\\\\u304c\\\\u5f3e\\\\u3051\\\\u308b\\\": 1, \\\"makey\\\": 2, \\\"only\\\": 5, \\\"tate\\\": 19, \\\"yoko\\\": 17, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u5185\\\\u3067\\\\u3042\\\\u308c\\\\u3070\\\\u3001\\\\u4e2d\\\\u5fc3\\\\u304b\\\\u3089\\\\u306e\\\\u5bfe\\\\u8c61\\\\u70b9\\\\u3092\\\\u9078\\\\u3076\\\\u4e8b\\\\u306b\\\\u3088\\\\u308a\\\\u3001\\\": 1, \\\"\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u4e2d\\\\u5fc3\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u3001\\\": 1, \\\"\\\\u5206\\\\u5272\\\\u3067\\\\u304d\\\\u308b\\\\u3002\\\\u305d\\\\u3046\\\\u3058\\\\u3083\\\\u306a\\\\u3044\\\\u3068\\\\u3060\\\\u3081\\\": 1, \\\"pat\\\": 11, \\\"quit\\\": 1, \\\"dx\\\": 15, \\\"dy\\\": 20, \\\"cog\\\": 12, \\\"\\\\u771f\\\\u3093\\\\u4e2d\\\\u3092\\\\u901a\\\\u308c\\\\u3070\\\\u5fc5\\\\u305a\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u3066\\\\u3053\\\\u308c\\\\u304c\\\\u6700\\\\u5927\\\\u5024\\\\u3060\\\\u304c\\\\u3001\\\\u81ea\\\\u5206\\\\u81ea\\\\u8eab\\\\u304c\\\\u771f\\\\u3093\\\\u4e2d\\\\u306e\\\\u5ea7\\\\u6a19\\\\u306e\\\\u5834\\\\u5408\\\\u306f\\\\u81ea\\\\u5206\\\\u81ea\\\\u4fe1\\\\u3092\\\\u901a\\\\u308b\\\\u3069\\\\u3093\\\\u306a\\\\u76f4\\\\u7dda\\\\u3082\\\\u4e8c\\\\u5206\\\\u3067\\\\u304d\\\\u308b\\\": 1, \\\"multi\\\": 14, \\\"\\\\u5bfe\\\\u89d2\\\\u7dda\\\": 1, \\\"\\\\u70b9\\\": 1, \\\"bunkatsu\\\": 3, \\\"atcoder\\\": 4, \\\"beginner\\\": 3, \\\"contest\\\": 3, \\\"men\\\": 11, \\\"dif\\\": 3, \\\"\\\\u3067\\\\u3064oo\\\": 1, \\\"you\\\": 1, \\\"play\\\": 1, \\\"cards\\\": 1, \\\"you're\\\": 1, \\\"dealt\\\": 1, \\\"d'\\\": 3, \\\"check\\\": 18, \\\"nn\\\": 1, \\\"xeven\\\": 2, \\\"yeven\\\": 2, \\\"tue\\\": 1, \\\"may\\\": 1, \\\"shinba\\\": 1, \\\"horizon\\\": 3, \\\"vertical\\\": 3, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u5b58\\\\u5728\\\\u3059\\\\u308c\\\\u3070\\\\u4e09\\\\u89d2\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"\\\\u76f4\\\\u7dda\\\\u4e0a\\\\u306b\\\\u306a\\\\u3044\\\\u6642\\\": 1, \\\"right\\\": 6, \\\"sqs\\\": 1, \\\"another\\\": 3, \\\"ignore\\\": 1, \\\"trailing\\\": 1, \\\"spaces\\\": 1, \\\"buf\\\": 6, \\\"ver\\\": 5, \\\"hori\\\": 4, \\\"square\\\": 2, \\\"sm\\\": 9, \\\"co\\\": 4, \\\"debug\\\": 2, \\\"dprint\\\": 1, \\\"args\\\": 3, \\\"kwargs\\\": 2, \\\"nr\\\": 3, \\\"point\\\": 3, \\\"candidate\\\": 6, \\\"way\\\": 3, \\\"cenx\\\": 2, \\\"ceny\\\": 2, \\\"readints\\\": 1, \\\"ncr\\\": 1, \\\"has\\\": 4, \\\"duplicates\\\": 1, \\\"seen\\\": 4, \\\"divisor\\\": 37, \\\"coordinates\\\": 1, \\\"harf\\\": 5, \\\"axis\\\": 2, \\\"any\\\": 1, \\\"case\\\": 3, \\\"lsq\\\": 2, \\\"rsq\\\": 2, \\\"wk\\\": 6, \\\"usq\\\": 2, \\\"dsq\\\": 2, \\\"equal\\\": 1, \\\"output\\\": 9, \\\"half\\\": 5, \\\"\\\\u518d\\\\u5e30\\\\u95a2\\\\u6570\\\\u306e\\\\u4e0a\\\\u9650\\\": 1, \\\"\\\\u4ee5\\\\u4e0a\\\\u306e\\\\u5834\\\\u5408python\\\": 1, \\\"dcp\\\": 1, \\\"\\\\u5206\\\\u63a2\\\\u7d22\\\": 1, \\\"a\\\\u306f\\\\u30bd\\\\u30fc\\\\u30c8\\\\u6e08\\\\u307f\\\\u3067\\\\u3042\\\\u308b\\\\u5fc5\\\\u8981\\\\u3042\\\\u308a\\\\u3002a\\\\u306e\\\\u4e2d\\\\u304b\\\\u3089x\\\\u672a\\\\u6e80\\\\u306e\\\\u8981\\\\u7d20\\\\u6570\\\\u3092\\\\u8fd4\\\\u3059\\\\u3002right\\\\u3060\\\\u3068\\\\u4ee5\\\\u4e0b\\\": 1, \\\"appendleft\\\": 1, \\\"rotate\\\": 1, \\\"\\\\u3067\\\": 1, \\\"\\\\u2192\\\": 1, \\\"\\\\u306bn\\\\u56de\\\\u30ed\\\\u30fc\\\\u30c6\\\\u30fc\\\\u30c8\\\": 1, \\\"\\\\u6587\\\\u5b57\\\\u5217\\\\u3092\\\\u500b\\\\u6570\\\\u30ab\\\\u30a6\\\\u30f3\\\\u30c8\\\\u8f9e\\\\u66f8\\\\u306b\\\\u3001\\\": 1, \\\"most\\\": 5, \\\"common\\\": 21, \\\"values\\\": 7, \\\"items\\\": 2, \\\"\\\\u7d2f\\\\u7a4d\\\\u548c\\\": 1, \\\"\\\\u3068\\\\u3057\\\\u306a\\\\u3044\\\\u3053\\\\u3068\\\\u3001\\\\u8fd4\\\\u308a\\\\u5024\\\\u306fnone\\\": 1, \\\"\\\\u53e4\\\\u3044atcoder\\\\u30b3\\\\u30f3\\\\u30c6\\\\u30b9\\\\u30c8\\\\u306e\\\\u5834\\\\u5408gcd\\\\u306a\\\\u3069\\\\u306f\\\\u3053\\\\u3053\\\\u304b\\\\u3089import\\\\u3059\\\\u308b\\\": 1, \\\"pypy\\\\u3067\\\\u3082\\\\u3046\\\\u3054\\\\u304f\\\": 1, \\\"maxsize\\\\u306f\\\\u4fdd\\\\u5b58\\\\u3059\\\\u308b\\\\u30c7\\\\u30fc\\\\u30bf\\\\u6570\\\\u306e\\\\u6700\\\\u5927\\\\u5024\\\\u3001\\\": 1, \\\"n\\\\u304c\\\\u6700\\\\u3082\\\\u9ad8\\\\u52b9\\\\u7387\\\": 1, \\\"printe\\\": 1, \\\"file\\\": 1, \\\"stderr\\\": 1, \\\"printl\\\": 1, \\\"inds\\\": 4, \\\"alp\\\": 2, \\\"cap\\\": 4, \\\"ord\\\": 4, \\\"matmat\\\": 1, \\\"matvec\\\": 1, \\\"\\\\u4e8c\\\\u500b\\\\u76ee\\\\u306e\\\\u8981\\\\u7d20\\\\u3067\\\\u964d\\\\u9806\\\\u4e26\\\\u3073\\\\u66ff\\\\u3048\\\": 1, \\\"\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u30d9\\\\u30af\\\\u30c8\\\\u30eb\\\": 1, \\\"\\\\u6539\\\\u884c\\\\u884c\\\\u5217\\\": 1, \\\"full\\\": 9, \\\"hantei\\\": 3, \\\"ld\\\": 3, \\\"lu\\\": 3, \\\"rd\\\": 3, \\\"ru\\\": 3, \\\"mins\\\": 2, \\\"\\\\u554f\\\\u984c\\\\uff1ahttps\\\": 1, \\\"jp\\\": 2, \\\"contests\\\": 1, \\\"tasks\\\": 1, \\\"points\\\": 3, \\\"\\\\u4e09\\\\u89d2\\\\u5f62\\\": 2, \\\"\\\\u306e\\\\u9762\\\\u7a4d\\\": 2, \\\"wy\\\": 5, \\\"xh\\\": 5, \\\"\\\\u9577\\\\u65b9\\\\u5f62\\\\u306e\\\\u9762\\\\u7a4d\\\": 1, \\\"extend\\\": 4, \\\"'w\\\\u306e\\\\u9762\\\\u7a4d'\\\": 1, \\\"'h\\\\u306e\\\\u9762\\\\u7a4d'\\\": 1, \\\"'w\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62'\\\": 1, \\\"'h\\\\u306e\\\\u9577\\\\u65b9\\\\u5f62'\\\": 1, \\\"'w\\\": 1, \\\"h'\\\": 1, \\\"max\\\\u304c\\\\u8907\\\\u6570\\\\u3042\\\\u308b\\\\u304b\\\": 1, \\\"inside\\\": 1, \\\"\\\\u521d\\\\u9805s\\\": 1, \\\"\\\\u4ea4\\\\u5deed\\\\u306en\\\\u500b\\\\u306e\\\\u6570\\\\u5217\\\\u306e\\\\u548c\\\": 1, \\\"arithmetic\\\": 1, \\\"progression\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"a\\\\u3068b\\\\u306e\\\\u6700\\\\u5c0f\\\\u516c\\\\u500d\\\\u6570\\\": 1, \\\"g\\\": 5, \\\"xyplus\\\": 1, \\\"\\\\u91cd\\\\u5fc3\\\\u306b\\\\u6765\\\\u308b\\\\u6642\\\\u306f\\\\u8907\\\\u6570\\\\u3001\\\\u7dda\\\\u4e0a\\\\u3068\\\\u5185\\\\u90e8\\\\u306f\\\": 1, \\\"\\\\u3053\\\": 1, \\\"sp\\\": 3, \\\"fraction\\\": 3, \\\"rectanglecutting\\\": 4, \\\"lines\\\": 7, \\\"sv\\\": 6, \\\"separate\\\": 2, \\\"straight\\\": 2, \\\"line\\\": 123, \\\"\\\\u306e\\\\u50be\\\\u304d\\\": 2, \\\"\\\\u7dda\\\\u4e0a\\\\u306b\\\\u3042\\\\u308b\\\\u6642\\\": 1, \\\"\\\\u7b49\\\\u5206\\\\u53ef\\\\u80fd\\\": 1, \\\"\\\\u306b\\\\u3064\\\\u3044\\\\u3066\\\": 2, \\\"\\\\u7e26\\\\u6a2a\\\\u3067\\\\u5206\\\\u5272\\\\u3059\\\\u308b\\\": 1, \\\"\\\\u7e26\\\": 1, \\\"\\\\u6a2a\\\": 1, \\\"sh\\\": 4, \\\"dbg\\\": 4, \\\"kb\\\": 3, \\\"bytes\\\": 3, \\\"divide\\\": 41, \\\"ext\\\": 3, \\\"x\\\\u306e\\\\u65b9\\\\u304c\\\\u5927\\\\u304d\\\\u304f\\\\u306a\\\\u304f\\\\u3066\\\\u306f\\\\u306a\\\\u3089\\\\u306a\\\\u3044\\\": 1, \\\"future\\\": 1, \\\"function\\\": 1, \\\"io\\\": 1, \\\"start\\\": 1, \\\"clock\\\": 1, \\\"siki\\\": 2, \\\"include\\\": 3, \\\"stdio\\\": 1, \\\"void\\\": 2, \\\"scanf\\\": 2, \\\"printf\\\": 1, \\\"stdinput\\\": 2, \\\"xset\\\": 2, \\\"yset\\\": 4, \\\"matched\\\": 4, \\\"cd\\\": 6, \\\"intersection\\\": 4, \\\"small\\\": 9, \\\"herf\\\": 4, \\\"round\\\": 29, \\\"converter\\\": 6, \\\"larger\\\": 3, \\\"smaller\\\": 4, \\\"euclidean\\\": 3, \\\"gcm\\\": 4, \\\"getgcm\\\": 2, \\\"xy\\\": 15, \\\"greatest\\\": 12, \\\"divider\\\": 2, \\\"long\\\": 4, \\\"euclid\\\": 2, \\\"\\\\u8a08\\\\u7b97\\\\u91cf\\\\u554f\\\\u984c\\\\u3042\\\\u308a\\\": 1, \\\"lg\\\": 6, \\\"div\\\": 7, \\\"mygcd\\\": 3, \\\"version\\\": 1, \\\"minor\\\": 1, \\\"bb\\\": 8, \\\"\\\\u5c0f\\\\u6797\\\\u52c7\\\\u5e0c\\\": 1, \\\"mb\\\": 1, \\\"ex\\\": 2, \\\"getresult\\\": 2, \\\"gc\\\": 4, \\\"greatestdivisor\\\": 2, \\\"twoset\\\": 2, \\\"alds\\\": 1, \\\"java\\\": 1, \\\"util\\\": 1, \\\"scanner\\\": 7, \\\"public\\\": 3, \\\"static\\\": 2, \\\"system\\\": 2, \\\"nextint\\\": 2, \\\"close\\\": 1, \\\"println\\\": 1, \\\"helper\\\": 3, \\\"zzz\\\": 16, \\\"maximum\\\": 4, \\\"\\\\u306fswap\\\": 1, \\\"\\\\u5024\\\\u306e\\\\u4ea4\\\\u63db\\\": 1, \\\"\\\\u3092\\\\u8868\\\\u3059\\\": 1, \\\"\\\\u30e6\\\\u30fc\\\\u30af\\\\u30ea\\\\u30c3\\\\u30c9\\\\u306e\\\\u4e92\\\\u9664\\\\u6cd5\\\\u306b\\\\u3088\\\\u308a\\\\u6700\\\\u5927\\\\u516c\\\\u7d04\\\\u6570\\\": 1, \\\"greatestcommondivisor\\\\u3092\\\\u6c42\\\\u3081\\\\u308b\\\": 1, 